// third_party/blink/public/mojom/dwrite_font_proxy/dwrite_font_proxy.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_DWRITE_FONT_PROXY_DWRITE_FONT_PROXY_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_DWRITE_FONT_PROXY_DWRITE_FONT_PROXY_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}
namespace blink {
namespace mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_FindFamily_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> family_name;

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_FindFamily_Params_Data>;

    DWriteFontProxy_FindFamily_Params_Data();
    ~DWriteFontProxy_FindFamily_Params_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_FindFamily_Params_Data) == 16, "Bad sizeof(DWriteFontProxy_FindFamily_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_FindFamily_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t out_index;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_FindFamily_ResponseParams_Data>;

    DWriteFontProxy_FindFamily_ResponseParams_Data();
    ~DWriteFontProxy_FindFamily_ResponseParams_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_FindFamily_ResponseParams_Data) == 16, "Bad sizeof(DWriteFontProxy_FindFamily_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_GetFamilyCount_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_GetFamilyCount_Params_Data>;

    DWriteFontProxy_GetFamilyCount_Params_Data();
    ~DWriteFontProxy_GetFamilyCount_Params_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_GetFamilyCount_Params_Data) == 8, "Bad sizeof(DWriteFontProxy_GetFamilyCount_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_GetFamilyCount_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t out_count;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_GetFamilyCount_ResponseParams_Data>;

    DWriteFontProxy_GetFamilyCount_ResponseParams_Data();
    ~DWriteFontProxy_GetFamilyCount_ResponseParams_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_GetFamilyCount_ResponseParams_Data) == 16, "Bad sizeof(DWriteFontProxy_GetFamilyCount_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_GetFamilyNames_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t family_index;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_GetFamilyNames_Params_Data>;

    DWriteFontProxy_GetFamilyNames_Params_Data();
    ~DWriteFontProxy_GetFamilyNames_Params_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_GetFamilyNames_Params_Data) == 16, "Bad sizeof(DWriteFontProxy_GetFamilyNames_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_GetFamilyNames_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::DWriteStringPair_Data>>> out_family_names;

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_GetFamilyNames_ResponseParams_Data>;

    DWriteFontProxy_GetFamilyNames_ResponseParams_Data();
    ~DWriteFontProxy_GetFamilyNames_ResponseParams_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_GetFamilyNames_ResponseParams_Data) == 16, "Bad sizeof(DWriteFontProxy_GetFamilyNames_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_GetFontFiles_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t family_index;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_GetFontFiles_Params_Data>;

    DWriteFontProxy_GetFontFiles_Params_Data();
    ~DWriteFontProxy_GetFontFiles_Params_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_GetFontFiles_Params_Data) == 16, "Bad sizeof(DWriteFontProxy_GetFontFiles_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_GetFontFiles_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data>>> file_paths;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlyFile_Data>>> file_handles;

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_GetFontFiles_ResponseParams_Data>;

    DWriteFontProxy_GetFontFiles_ResponseParams_Data();
    ~DWriteFontProxy_GetFontFiles_ResponseParams_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_GetFontFiles_ResponseParams_Data) == 24, "Bad sizeof(DWriteFontProxy_GetFontFiles_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_GetUniqueFontLookupMode_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_GetUniqueFontLookupMode_Params_Data>;

    DWriteFontProxy_GetUniqueFontLookupMode_Params_Data();
    ~DWriteFontProxy_GetUniqueFontLookupMode_Params_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_GetUniqueFontLookupMode_Params_Data) == 8, "Bad sizeof(DWriteFontProxy_GetUniqueFontLookupMode_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_GetUniqueFontLookupMode_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t lookup_mode;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_GetUniqueFontLookupMode_ResponseParams_Data>;

    DWriteFontProxy_GetUniqueFontLookupMode_ResponseParams_Data();
    ~DWriteFontProxy_GetUniqueFontLookupMode_ResponseParams_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_GetUniqueFontLookupMode_ResponseParams_Data) == 16, "Bad sizeof(DWriteFontProxy_GetUniqueFontLookupMode_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_MatchUniqueFont_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> font_unique_name;

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_MatchUniqueFont_Params_Data>;

    DWriteFontProxy_MatchUniqueFont_Params_Data();
    ~DWriteFontProxy_MatchUniqueFont_Params_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_MatchUniqueFont_Params_Data) == 16, "Bad sizeof(DWriteFontProxy_MatchUniqueFont_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_MatchUniqueFont_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data> file_path;
    uint32_t ttc_index;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_MatchUniqueFont_ResponseParams_Data>;

    DWriteFontProxy_MatchUniqueFont_ResponseParams_Data();
    ~DWriteFontProxy_MatchUniqueFont_ResponseParams_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_MatchUniqueFont_ResponseParams_Data) == 24, "Bad sizeof(DWriteFontProxy_MatchUniqueFont_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_GetUniqueNameLookupTableIfAvailable_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_GetUniqueNameLookupTableIfAvailable_Params_Data>;

    DWriteFontProxy_GetUniqueNameLookupTableIfAvailable_Params_Data();
    ~DWriteFontProxy_GetUniqueNameLookupTableIfAvailable_Params_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_GetUniqueNameLookupTableIfAvailable_Params_Data) == 8, "Bad sizeof(DWriteFontProxy_GetUniqueNameLookupTableIfAvailable_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_GetUniqueNameLookupTableIfAvailable_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t sync_available : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlySharedMemoryRegion_Data> font_lookup_table;

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_GetUniqueNameLookupTableIfAvailable_ResponseParams_Data>;

    DWriteFontProxy_GetUniqueNameLookupTableIfAvailable_ResponseParams_Data();
    ~DWriteFontProxy_GetUniqueNameLookupTableIfAvailable_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(DWriteFontProxy_GetUniqueNameLookupTableIfAvailable_ResponseParams_Data) == 24, "Bad sizeof(DWriteFontProxy_GetUniqueNameLookupTableIfAvailable_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_GetUniqueNameLookupTable_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_GetUniqueNameLookupTable_Params_Data>;

    DWriteFontProxy_GetUniqueNameLookupTable_Params_Data();
    ~DWriteFontProxy_GetUniqueNameLookupTable_Params_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_GetUniqueNameLookupTable_Params_Data) == 8, "Bad sizeof(DWriteFontProxy_GetUniqueNameLookupTable_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_GetUniqueNameLookupTable_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlySharedMemoryRegion_Data> font_lookup_table;

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_GetUniqueNameLookupTable_ResponseParams_Data>;

    DWriteFontProxy_GetUniqueNameLookupTable_ResponseParams_Data();
    ~DWriteFontProxy_GetUniqueNameLookupTable_ResponseParams_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_GetUniqueNameLookupTable_ResponseParams_Data) == 16, "Bad sizeof(DWriteFontProxy_GetUniqueNameLookupTable_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_MapCharacters_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> text;
    mojo::internal::Pointer<internal::DWriteFontStyle_Data> font_style;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> locale_name;
    uint32_t reading_direction;
    uint8_t pad3_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> base_family_name;

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_MapCharacters_Params_Data>;

    DWriteFontProxy_MapCharacters_Params_Data();
    ~DWriteFontProxy_MapCharacters_Params_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_MapCharacters_Params_Data) == 48, "Bad sizeof(DWriteFontProxy_MapCharacters_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_MapCharacters_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::MapCharactersResult_Data> out;

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_MapCharacters_ResponseParams_Data>;

    DWriteFontProxy_MapCharacters_ResponseParams_Data();
    ~DWriteFontProxy_MapCharacters_ResponseParams_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_MapCharacters_ResponseParams_Data) == 16, "Bad sizeof(DWriteFontProxy_MapCharacters_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_FallbackFamilyAndStyleForCodepoint_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> base_family_name;
    mojo::internal::Pointer<mojo::internal::String_Data> bcp47_language_tag;
    uint32_t codepoint;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_FallbackFamilyAndStyleForCodepoint_Params_Data>;

    DWriteFontProxy_FallbackFamilyAndStyleForCodepoint_Params_Data();
    ~DWriteFontProxy_FallbackFamilyAndStyleForCodepoint_Params_Data() = delete;
};
static_assert(sizeof(DWriteFontProxy_FallbackFamilyAndStyleForCodepoint_Params_Data) == 32, "Bad sizeof(DWriteFontProxy_FallbackFamilyAndStyleForCodepoint_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) DWriteFontProxy_FallbackFamilyAndStyleForCodepoint_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::FallbackFamilyAndStyle_Data> fallback_result;

private:
    friend class mojo::internal::MessageFragment<DWriteFontProxy_FallbackFamilyAndStyleForCodepoint_ResponseParams_Data>;

    DWriteFontProxy_FallbackFamilyAndStyleForCodepoint_ResponseParams_Data();
    ~DWriteFontProxy_FallbackFamilyAndStyleForCodepoint_ResponseParams_Data() = delete;
};
static_assert(
