// third_party/blink/public/mojom/webauthn/virtual_authenticator.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_WEBAUTHN_VIRTUAL_AUTHENTICATOR_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_WEBAUTHN_VIRTUAL_AUTHENTICATOR_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}
namespace blink {
namespace test {
namespace mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_GetUniqueId_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<VirtualAuthenticator_GetUniqueId_Params_Data>;

    VirtualAuthenticator_GetUniqueId_Params_Data();
    ~VirtualAuthenticator_GetUniqueId_Params_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_GetUniqueId_Params_Data) == 8, "Bad sizeof(VirtualAuthenticator_GetUniqueId_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_GetUniqueId_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> id;

private:
    friend class mojo::internal::MessageFragment<VirtualAuthenticator_GetUniqueId_ResponseParams_Data>;

    VirtualAuthenticator_GetUniqueId_ResponseParams_Data();
    ~VirtualAuthenticator_GetUniqueId_ResponseParams_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_GetUniqueId_ResponseParams_Data) == 16, "Bad sizeof(VirtualAuthenticator_GetUniqueId_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_AddRegistration_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::RegisteredKey_Data> key;

private:
    friend class mojo::internal::MessageFragment<VirtualAuthenticator_AddRegistration_Params_Data>;

    VirtualAuthenticator_AddRegistration_Params_Data();
    ~VirtualAuthenticator_AddRegistration_Params_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_AddRegistration_Params_Data) == 16, "Bad sizeof(VirtualAuthenticator_AddRegistration_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_AddRegistration_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t added : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<VirtualAuthenticator_AddRegistration_ResponseParams_Data>;

    VirtualAuthenticator_AddRegistration_ResponseParams_Data();
    ~VirtualAuthenticator_AddRegistration_ResponseParams_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_AddRegistration_ResponseParams_Data) == 16, "Bad sizeof(VirtualAuthenticator_AddRegistration_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_GetRegistrations_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<VirtualAuthenticator_GetRegistrations_Params_Data>;

    VirtualAuthenticator_GetRegistrations_Params_Data();
    ~VirtualAuthenticator_GetRegistrations_Params_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_GetRegistrations_Params_Data) == 8, "Bad sizeof(VirtualAuthenticator_GetRegistrations_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_GetRegistrations_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::RegisteredKey_Data>>> keys;

private:
    friend class mojo::internal::MessageFragment<VirtualAuthenticator_GetRegistrations_ResponseParams_Data>;

    VirtualAuthenticator_GetRegistrations_ResponseParams_Data();
    ~VirtualAuthenticator_GetRegistrations_ResponseParams_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_GetRegistrations_ResponseParams_Data) == 16, "Bad sizeof(VirtualAuthenticator_GetRegistrations_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_RemoveRegistration_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> key_handle;

private:
    friend class mojo::internal::MessageFragment<VirtualAuthenticator_RemoveRegistration_Params_Data>;

    VirtualAuthenticator_RemoveRegistration_Params_Data();
    ~VirtualAuthenticator_RemoveRegistration_Params_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_RemoveRegistration_Params_Data) == 16, "Bad sizeof(VirtualAuthenticator_RemoveRegistration_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_RemoveRegistration_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t removed : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<VirtualAuthenticator_RemoveRegistration_ResponseParams_Data>;

    VirtualAuthenticator_RemoveRegistration_ResponseParams_Data();
    ~VirtualAuthenticator_RemoveRegistration_ResponseParams_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_RemoveRegistration_ResponseParams_Data) == 16, "Bad sizeof(VirtualAuthenticator_RemoveRegistration_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_ClearRegistrations_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<VirtualAuthenticator_ClearRegistrations_Params_Data>;

    VirtualAuthenticator_ClearRegistrations_Params_Data();
    ~VirtualAuthenticator_ClearRegistrations_Params_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_ClearRegistrations_Params_Data) == 8, "Bad sizeof(VirtualAuthenticator_ClearRegistrations_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_ClearRegistrations_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<VirtualAuthenticator_ClearRegistrations_ResponseParams_Data>;

    VirtualAuthenticator_ClearRegistrations_ResponseParams_Data();
    ~VirtualAuthenticator_ClearRegistrations_ResponseParams_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_ClearRegistrations_ResponseParams_Data) == 8, "Bad sizeof(VirtualAuthenticator_ClearRegistrations_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_GetLargeBlob_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> key_handle;

private:
    friend class mojo::internal::MessageFragment<VirtualAuthenticator_GetLargeBlob_Params_Data>;

    VirtualAuthenticator_GetLargeBlob_Params_Data();
    ~VirtualAuthenticator_GetLargeBlob_Params_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_GetLargeBlob_Params_Data) == 16, "Bad sizeof(VirtualAuthenticator_GetLargeBlob_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_GetLargeBlob_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> blob;

private:
    friend class mojo::internal::MessageFragment<VirtualAuthenticator_GetLargeBlob_ResponseParams_Data>;

    VirtualAuthenticator_GetLargeBlob_ResponseParams_Data();
    ~VirtualAuthenticator_GetLargeBlob_ResponseParams_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_GetLargeBlob_ResponseParams_Data) == 16, "Bad sizeof(VirtualAuthenticator_GetLargeBlob_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_SetLargeBlob_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> key_handle;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> blob;

private:
    friend class mojo::internal::MessageFragment<VirtualAuthenticator_SetLargeBlob_Params_Data>;

    VirtualAuthenticator_SetLargeBlob_Params_Data();
    ~VirtualAuthenticator_SetLargeBlob_Params_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_SetLargeBlob_Params_Data) == 24, "Bad sizeof(VirtualAuthenticator_SetLargeBlob_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_SetLargeBlob_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t set : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<VirtualAuthenticator_SetLargeBlob_ResponseParams_Data>;

    VirtualAuthenticator_SetLargeBlob_ResponseParams_Data();
    ~VirtualAuthenticator_SetLargeBlob_ResponseParams_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_SetLargeBlob_ResponseParams_Data) == 16, "Bad sizeof(VirtualAuthenticator_SetLargeBlob_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_SetUserVerified_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t verified : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<VirtualAuthenticator_SetUserVerified_Params_Data>;

    VirtualAuthenticator_SetUserVerified_Params_Data();
    ~VirtualAuthenticator_SetUserVerified_Params_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_SetUserVerified_Params_Data) == 16, "Bad sizeof(VirtualAuthenticator_SetUserVerified_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticator_SetUserVerified_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<VirtualAuthenticator_SetUserVerified_ResponseParams_Data>;

    VirtualAuthenticator_SetUserVerified_ResponseParams_Data();
    ~VirtualAuthenticator_SetUserVerified_ResponseParams_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticator_SetUserVerified_ResponseParams_Data) == 8, "Bad sizeof(VirtualAuthenticator_SetUserVerified_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticatorManager_CreateAuthenticator_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::VirtualAuthenticatorOptions_Data> options;

private:
    friend class mojo::internal::MessageFragment<VirtualAuthenticatorManager_CreateAuthenticator_Params_Data>;

    VirtualAuthenticatorManager_CreateAuthenticator_Params_Data();
    ~VirtualAuthenticatorManager_CreateAuthenticator_Params_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticatorManager_CreateAuthenticator_Params_Data) == 16, "Bad sizeof(VirtualAuthenticatorManager_CreateAuthenticator_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticatorManager_CreateAuthenticator_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data authenticator;

private:
    friend class mojo::internal::MessageFragment<VirtualAuthenticatorManager_CreateAuthenticator_ResponseParams_Data>;

    VirtualAuthenticatorManager_CreateAuthenticator_ResponseParams_Data();
    ~VirtualAuthenticatorManager_CreateAuthenticator_ResponseParams_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticatorManager_CreateAuthenticator_ResponseParams_Data) == 16, "Bad sizeof(VirtualAuthenticatorManager_CreateAuthenticator_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticatorManager_GetAuthenticators_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<VirtualAuthenticatorManager_GetAuthenticators_Params_Data>;

    VirtualAuthenticatorManager_GetAuthenticators_Params_Data();
    ~VirtualAuthenticatorManager_GetAuthenticators_Params_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticatorManager_GetAuthenticators_Params_Data) == 8, "Bad sizeof(VirtualAuthenticatorManager_GetAuthenticators_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticatorManager_GetAuthenticators_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Interface_Data>> authenticators;

private:
    friend class mojo::internal::MessageFragment<VirtualAuthenticatorManager_GetAuthenticators_ResponseParams_Data>;

    VirtualAuthenticatorManager_GetAuthenticators_ResponseParams_Data();
    ~VirtualAuthenticatorManager_GetAuthenticators_ResponseParams_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticatorManager_GetAuthenticators_ResponseParams_Data) == 16, "Bad sizeof(VirtualAuthenticatorManager_GetAuthenticators_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticatorManager_RemoveAuthenticator_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> id;

private:
    friend class mojo::internal::MessageFragment<VirtualAuthenticatorManager_RemoveAuthenticator_Params_Data>;

    VirtualAuthenticatorManager_RemoveAuthenticator_Params_Data();
    ~VirtualAuthenticatorManager_RemoveAuthenticator_Params_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticatorManager_RemoveAuthenticator_Params_Data) == 16, "Bad sizeof(VirtualAuthenticatorManager_RemoveAuthenticator_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticatorManager_RemoveAuthenticator_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t removed : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<VirtualAuthenticatorManager_RemoveAuthenticator_ResponseParams_Data>;

    VirtualAuthenticatorManager_RemoveAuthenticator_ResponseParams_Data();
    ~VirtualAuthenticatorManager_RemoveAuthenticator_ResponseParams_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticatorManager_RemoveAuthenticator_ResponseParams_Data) == 16, "Bad sizeof(VirtualAuthenticatorManager_RemoveAuthenticator_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticatorManager_ClearAuthenticators_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<VirtualAuthenticatorManager_ClearAuthenticators_Params_Data>;

    VirtualAuthenticatorManager_ClearAuthenticators_Params_Data();
    ~VirtualAuthenticatorManager_ClearAuthenticators_Params_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticatorManager_ClearAuthenticators_Params_Data) == 8, "Bad sizeof(VirtualAuthenticatorManager_ClearAuthenticators_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) VirtualAuthenticatorManager_ClearAuthenticators_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<VirtualAuthenticatorManager_ClearAuthenticators_ResponseParams_Data>;

    VirtualAuthenticatorManager_ClearAuthenticators_ResponseParams_Data();
    ~VirtualAuthenticatorManager_ClearAuthenticators_ResponseParams_Data() = delete;
};
static_assert(sizeof(VirtualAuthenticatorManager_ClearAuthenticators_ResponseParams_Data) == 8, "Bad sizeof(VirtualAuthenticatorManager_ClearAuthenticators_ResponseParams_Data)");

} // namespace internal
class VirtualAuthenticator_GetUniqueId_ParamsDataView {
public:
    VirtualAuthenticator_GetUniqueId_ParamsDataView() = default;

    VirtualAuthenticator_GetUniqueId_ParamsDataView(internal::VirtualAuthenticator_GetUniqueId_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const { return !data_; }

private:
    internal::VirtualAuthenticator_GetUniqueId_Params_Data* data_ = nullptr;
};

class VirtualAuthenticator_GetUniqueId_ResponseParamsDataView {
public:
    VirtualAuthenticator_GetUniqueId_ResponseParamsDataView() = default;

    VirtualAuthenticator_GetUniqueId_ResponseParamsDataView(internal::VirtualAuthenticator_GetUniqueId_ResponseParams_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

