// third_party/blink/public/mojom/mediastream/media_stream.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_MEDIASTREAM_MEDIA_STREAM_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_MEDIASTREAM_MEDIA_STREAM_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}
namespace blink {
namespace mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaStreamDeviceObserver_OnDeviceStopped_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> label;
    mojo::internal::Pointer<internal::MediaStreamDevice_Data> device;

private:
    friend class mojo::internal::MessageFragment<MediaStreamDeviceObserver_OnDeviceStopped_Params_Data>;

    MediaStreamDeviceObserver_OnDeviceStopped_Params_Data();
    ~MediaStreamDeviceObserver_OnDeviceStopped_Params_Data() = delete;
};
static_assert(sizeof(MediaStreamDeviceObserver_OnDeviceStopped_Params_Data) == 24, "Bad sizeof(MediaStreamDeviceObserver_OnDeviceStopped_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaStreamDeviceObserver_OnDeviceChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> label;
    mojo::internal::Pointer<internal::MediaStreamDevice_Data> old_device;
    mojo::internal::Pointer<internal::MediaStreamDevice_Data> new_device;

private:
    friend class mojo::internal::MessageFragment<MediaStreamDeviceObserver_OnDeviceChanged_Params_Data>;

    MediaStreamDeviceObserver_OnDeviceChanged_Params_Data();
    ~MediaStreamDeviceObserver_OnDeviceChanged_Params_Data() = delete;
};
static_assert(sizeof(MediaStreamDeviceObserver_OnDeviceChanged_Params_Data) == 32, "Bad sizeof(MediaStreamDeviceObserver_OnDeviceChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaStreamDeviceObserver_OnDeviceRequestStateChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> label;
    mojo::internal::Pointer<internal::MediaStreamDevice_Data> device;
    int32_t new_state;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaStreamDeviceObserver_OnDeviceRequestStateChange_Params_Data>;

    MediaStreamDeviceObserver_OnDeviceRequestStateChange_Params_Data();
    ~MediaStreamDeviceObserver_OnDeviceRequestStateChange_Params_Data() = delete;
};
static_assert(sizeof(MediaStreamDeviceObserver_OnDeviceRequestStateChange_Params_Data) == 32, "Bad sizeof(MediaStreamDeviceObserver_OnDeviceRequestStateChange_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaStreamDeviceObserver_OnDeviceCaptureHandleChange_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> label;
    mojo::internal::Pointer<internal::MediaStreamDevice_Data> device;

private:
    friend class mojo::internal::MessageFragment<MediaStreamDeviceObserver_OnDeviceCaptureHandleChange_Params_Data>;

    MediaStreamDeviceObserver_OnDeviceCaptureHandleChange_Params_Data();
    ~MediaStreamDeviceObserver_OnDeviceCaptureHandleChange_Params_Data() = delete;
};
static_assert(sizeof(MediaStreamDeviceObserver_OnDeviceCaptureHandleChange_Params_Data) == 24, "Bad sizeof(MediaStreamDeviceObserver_OnDeviceCaptureHandleChange_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaStreamDispatcherHost_GenerateStreams_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t request_id;
    uint8_t user_gesture : 1;
    uint8_t pad1_[3];
    mojo::internal::Pointer<internal::StreamControls_Data> controls;
    mojo::internal::Pointer<internal::StreamSelectionInfo_Data> audio_stream_selection_info;

private:
    friend class mojo::internal::MessageFragment<MediaStreamDispatcherHost_GenerateStreams_Params_Data>;

    MediaStreamDispatcherHost_GenerateStreams_Params_Data();
    ~MediaStreamDispatcherHost_GenerateStreams_Params_Data() = delete;
};
static_assert(sizeof(MediaStreamDispatcherHost_GenerateStreams_Params_Data) == 32, "Bad sizeof(MediaStreamDispatcherHost_GenerateStreams_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaStreamDispatcherHost_GenerateStreams_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t pan_tilt_zoom_allowed : 1;
    uint8_t pad1_[3];
    mojo::internal::Pointer<mojo::internal::String_Data> label;
    mojo::internal::Pointer<internal::StreamDevicesSet_Data> stream_devices;

private:
    friend class mojo::internal::MessageFragment<MediaStreamDispatcherHost_GenerateStreams_ResponseParams_Data>;

    MediaStreamDispatcherHost_GenerateStreams_ResponseParams_Data();
    ~MediaStreamDispatcherHost_GenerateStreams_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaStreamDispatcherHost_GenerateStreams_ResponseParams_Data) == 32, "Bad sizeof(MediaStreamDispatcherHost_GenerateStreams_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaStreamDispatcherHost_FocusCapturedSurface_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> label;
    uint8_t focus : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<MediaStreamDispatcherHost_FocusCapturedSurface_Params_Data>;

    MediaStreamDispatcherHost_FocusCapturedSurface_Params_Data();
    ~MediaStreamDispatcherHost_FocusCapturedSurface_Params_Data() = delete;
};
static_assert(sizeof(MediaStreamDispatcherHost_FocusCapturedSurface_Params_Data) == 24, "Bad sizeof(MediaStreamDispatcherHost_FocusCapturedSurface_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaStreamDispatcherHost_CancelRequest_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t request_id;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaStreamDispatcherHost_CancelRequest_Params_Data>;

    MediaStreamDispatcherHost_CancelRequest_Params_Data();
    ~MediaStreamDispatcherHost_CancelRequest_Params_Data() = delete;
};
static_assert(sizeof(MediaStreamDispatcherHost_CancelRequest_Params_Data) == 16, "Bad sizeof(MediaStreamDispatcherHost_CancelRequest_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaStreamDispatcherHost_StopStreamDevice_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> device_id;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> session_id;

private:
    friend class mojo::internal::MessageFragment<MediaStreamDispatcherHost_StopStreamDevice_Params_Data>;

    MediaStreamDispatcherHost_StopStreamDevice_Params_Data();
    ~MediaStreamDispatcherHost_StopStreamDevice_Params_Data() = delete;
};
static_assert(sizeof(MediaStreamDispatcherHost_StopStreamDevice_Params_Data) == 24, "Bad sizeof(MediaStreamDispatcherHost_StopStreamDevice_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaStreamDispatcherHost_OpenDevice_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t request_id;
    int32_t type;
    mojo::internal::Pointer<mojo::internal::String_Data> device_id;

private:
    friend class mojo::internal::MessageFragment<MediaStreamDispatcherHost_OpenDevice_Params_Data>;

    MediaStreamDispatcherHost_OpenDevice_Params_Data();
    ~MediaStreamDispatcherHost_OpenDevice_Params_Data() = delete;
};
static_assert(sizeof(MediaStreamDispatcherHost_OpenDevice_Params_Data) == 24, "Bad sizeof(MediaStreamDispatcherHost_OpenDevice_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaStreamDispatcherHost_OpenDevice_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<mojo::internal::String_Data> label;
    mojo::internal::Pointer<internal::MediaStreamDevice_Data> device;

private:
    friend class mojo::internal::MessageFragment<MediaStreamDispatcherHost_OpenDevice_ResponseParams_Data>;

    MediaStreamDispatcherHost_OpenDevice_ResponseParams_Data();
    ~MediaStreamDispatcherHost_OpenDevice_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaStreamDispatcherHost_OpenDevice_ResponseParams_Data) == 32, "Bad sizeof(MediaStreamDispatcherHost_OpenDevice_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaStreamDispatcherHost_CloseDevice_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> label;

private:
    friend class mojo::internal::MessageFragment<MediaStreamDispatcherHost_CloseDevice_Params_Data>;

    MediaStreamDispatcherHost_CloseDevice_Params_Data();
    ~MediaStreamDispatcherHost_CloseDevice_Params_Data() = delete;
};
static_assert(sizeof(MediaStreamDispatcherHost_CloseDevice_Params_Data) == 16, "Bad sizeof(MediaStreamDispatcherHost_CloseDevice_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaStreamDispatcherHost_SetCapturingLinkSecured_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> session_id;
    int32_t type;
    uint8_t is_secure : 1;
    uint8_t padfinal_[3];

private:
    friend class mojo::internal::MessageFragment<MediaStreamDispatcherHost_SetCapturingLinkSecured_Params_Data>;

    MediaStreamDispatcherHost_SetCapturingLinkSecured_Params_Data();
    ~MediaStreamDispatcherHost_SetCapturingLinkSecured_Params_Data() = delete;
};
static_assert(sizeof(MediaStreamDispatcherHost_SetCapturingLinkSecured_Params_Data) == 24, "Bad sizeof(MediaStreamDispatcherHost_SetCapturingLinkSecured_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaStreamDispatcherHost_OnStreamStarted_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> label;

private:
    friend class mojo::internal::MessageFragment<MediaStreamDispatcherHost_OnStreamStarted_Params_Data>;

    MediaStreamDispatcherHost_OnStreamStarted_Params_Data();
    ~MediaStreamDispatcherHost_OnStreamStarted_Params_Data() = delete;
};
static_assert(sizeof(MediaStreamDispatcherHost_OnStreamStarted_Params_Data) == 16, "Bad sizeof(MediaStreamDispatcherHost_OnStreamStarted_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaStreamDispatcherHost_Crop_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> device_id;
    mojo::internal::Pointer<::mojo_base::mojom::internal::Token_Data> crop_id;
    uint32_t crop_version;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaStreamDispatcherHost_Crop_Params_Data>;

    MediaStreamDispatcherHost_Crop_Params_Data();
    ~MediaStreamDispatcherHost_Crop_Params_Data() = delete;
};
static_assert(sizeof(MediaStreamDispatcherHost_Crop_Params_Data) == 32, "Bad sizeof(MediaStreamDispatcherHost_Crop_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaStreamDispatcherHost_Crop_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t crop_result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<MediaStreamDispatcherHost_Crop_ResponseParams_Data>;

    MediaStreamDispatcherHost_Crop_ResponseParams_Data();
    ~MediaStreamDispatcherHost_Crop_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaStreamDispatcherHost_Crop_ResponseParams_Data) == 16, "Bad sizeof(MediaStreamDispatcherHost_Crop_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaStreamDispatcherHost_GetOpenDevice_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t request_id;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> session_id;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> transfer_id;

private:
    friend class mojo::internal::MessageFragment<MediaStreamDispatcherHost_GetOpenDevice_Params_Data>;

    MediaStreamDispatcherHost_GetOpenDevice_Params_Data();
    ~MediaStreamDispatcherHost_GetOpenDevice_Params_Data() = delete;
};
static_assert(sizeof(MediaStreamDispatcherHost_GetOpenDevice_Params_Data) == 32, "Bad sizeof(MediaStreamDispatcherHost_GetOpenDevice_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaStreamDispatcherHost_GetOpenDevice_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t pad0_[4];
    mojo::internal::Pointer<internal::GetOpenDeviceResponse_Data> response;

private:
    friend class mojo::internal::MessageFragment<MediaStreamDispatcherHost_GetOpenDevice_ResponseParams_Data>;

    MediaStreamDispatcherHost_GetOpenDevice_ResponseParams_Data();
    ~MediaStreamDispatcherHost_GetOpenDevice_ResponseParams_Data() = delete;
};
static_assert(sizeof(MediaStreamDispatcherHost_GetOpenDevice_ResponseParams_Data) == 24, "Bad sizeof(MediaStreamDispatcherHost_GetOpenDevice_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaStreamDispatcherHost_KeepDeviceAliveForTransfer_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> session_id;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> transfer_id;

private:
    friend class mojo::internal::MessageFragment<MediaStreamDispatcherHost_KeepDeviceAliveForTransfer_Params_Data>;

    MediaStreamDispatcherHost_KeepDeviceAliveForTransfer_Params_Data();
    ~MediaStreamDispatcherHost_KeepDeviceAliveForTransfer_Params_Data() = delete;
};
static_assert(sizeof(MediaStreamDispatcherHost_KeepDeviceAliveForTransfer_Params_Data) == 24, "Bad sizeof(MediaStreamDispatcherHost_KeepDeviceAliveForTransfer_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaStreamDispatcherHost_KeepDeviceAliveForTransfer_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t device_found : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<MediaStreamDispatcherHost_KeepDeviceAliveForTransfer_ResponseParams_Data>;

    MediaStreamDispatcherHost_KeepDeviceAliveForTransfer_ResponseParams_Data();
    ~MediaStreamDispatcherHost_KeepDeviceAliveForTransfer_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(MediaStreamDispatcherHost_KeepDeviceAliveForTransfer_ResponseParams_Data) == 16, "Bad sizeof(MediaStreamDispatcherHost_KeepDeviceAliveForTransfer_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaStreamTrackMetricsHost_AddTrack_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint64_t id;
    uint8_t is_audio : 1;
    uint8_t is_remote : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<MediaStreamTrackMetricsHost_AddTrack_Params_Data>;

    MediaStreamTrackMetricsHost_AddTrack_Params_Data();
    ~MediaStreamTrackMetricsHost_AddTrack_Params_Data() = delete;
};
static_assert(sizeof(MediaStreamTrackMetricsHost_AddTrack_Params_Data) == 24, "Bad sizeof(MediaStreamTrackMetricsHost_AddTrack_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) MediaStreamTrackMetricsHost_RemoveTrack_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint64_t id;

private:
    friend class mojo::internal::MessageFragment<MediaStreamTrackMetricsHost_RemoveTrack_Params_Data>;

    MediaStreamTrackMetricsHost_RemoveTrack_Params_Data();
    ~MediaStreamTrackMetricsHost_RemoveTrack_Params_Data() = delete;
};
static_assert(sizeof(MediaStreamTrackMetricsHost_RemoveTrack_Params_Data) == 16, "Bad sizeof(MediaStreamTrackMetricsHost_RemoveTrack_Params_Data)");

} // namespace internal
class MediaStreamDeviceObserver_OnDeviceStopped_ParamsDataView {
public:
    MediaStreamDeviceObserver_OnDeviceStopped_ParamsDataView() = default;

    MediaStreamDeviceObserver_OnDeviceStopped_ParamsDataView(internal::MediaStreamDeviceObserver_OnDeviceStopped_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const { return !data_; }
    inline void GetLabelDataView(mojo::StringDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadLabel(UserType* output)
    {

        auto* pointer = data_->label.Get();
        return mojo::internal::Deserialize<mojo::StringDataView>(pointer, output, message_);
    }
    inline void GetDeviceDataView(MediaStreamDeviceDataView* output);

