// components/services/print_compositor/public/mojom/print_compositor.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_SERVICES_PRINT_COMPOSITOR_PUBLIC_MOJOM_PRINT_COMPOSITOR_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_SERVICES_PRINT_COMPOSITOR_PUBLIC_MOJOM_PRINT_COMPOSITOR_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}
namespace printing {
namespace mojom {
namespace internal {
class PrintCompositor_SetDiscardableSharedMemoryManager_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data manager;

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_SetDiscardableSharedMemoryManager_Params_Data>;

    PrintCompositor_SetDiscardableSharedMemoryManager_Params_Data();
    ~PrintCompositor_SetDiscardableSharedMemoryManager_Params_Data() = delete;
};
static_assert(sizeof(PrintCompositor_SetDiscardableSharedMemoryManager_Params_Data) == 16, "Bad sizeof(PrintCompositor_SetDiscardableSharedMemoryManager_Params_Data)");
class PrintCompositor_NotifyUnavailableSubframe_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint64_t frame_guid;

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_NotifyUnavailableSubframe_Params_Data>;

    PrintCompositor_NotifyUnavailableSubframe_Params_Data();
    ~PrintCompositor_NotifyUnavailableSubframe_Params_Data() = delete;
};
static_assert(sizeof(PrintCompositor_NotifyUnavailableSubframe_Params_Data) == 16, "Bad sizeof(PrintCompositor_NotifyUnavailableSubframe_Params_Data)");
class PrintCompositor_AddSubframeContent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint64_t frame_guid;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlySharedMemoryRegion_Data> serialized_content;
    mojo::internal::Pointer<mojo::internal::Map_Data<uint32_t, uint64_t>> subframe_content_info;

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_AddSubframeContent_Params_Data>;

    PrintCompositor_AddSubframeContent_Params_Data();
    ~PrintCompositor_AddSubframeContent_Params_Data() = delete;
};
static_assert(sizeof(PrintCompositor_AddSubframeContent_Params_Data) == 32, "Bad sizeof(PrintCompositor_AddSubframeContent_Params_Data)");
class PrintCompositor_SetAccessibilityTree_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::ax::mojom::internal::AXTreeUpdate_Data> accessibility_tree;

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_SetAccessibilityTree_Params_Data>;

    PrintCompositor_SetAccessibilityTree_Params_Data();
    ~PrintCompositor_SetAccessibilityTree_Params_Data() = delete;
};
static_assert(sizeof(PrintCompositor_SetAccessibilityTree_Params_Data) == 16, "Bad sizeof(PrintCompositor_SetAccessibilityTree_Params_Data)");
class PrintCompositor_CompositePageToPdf_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint64_t frame_guid;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlySharedMemoryRegion_Data> sk_region;
    mojo::internal::Pointer<mojo::internal::Map_Data<uint32_t, uint64_t>> subframe_content_info;

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_CompositePageToPdf_Params_Data>;

    PrintCompositor_CompositePageToPdf_Params_Data();
    ~PrintCompositor_CompositePageToPdf_Params_Data() = delete;
};
static_assert(sizeof(PrintCompositor_CompositePageToPdf_Params_Data) == 32, "Bad sizeof(PrintCompositor_CompositePageToPdf_Params_Data)");
class PrintCompositor_CompositePageToPdf_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlySharedMemoryRegion_Data> pdf_region;

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_CompositePageToPdf_ResponseParams_Data>;

    PrintCompositor_CompositePageToPdf_ResponseParams_Data();
    ~PrintCompositor_CompositePageToPdf_ResponseParams_Data() = delete;
};
static_assert(sizeof(PrintCompositor_CompositePageToPdf_ResponseParams_Data) == 24, "Bad sizeof(PrintCompositor_CompositePageToPdf_ResponseParams_Data)");
class PrintCompositor_CompositeDocumentToPdf_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint64_t frame_guid;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlySharedMemoryRegion_Data> sk_region;
    mojo::internal::Pointer<mojo::internal::Map_Data<uint32_t, uint64_t>> subframe_content_info;

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_CompositeDocumentToPdf_Params_Data>;

    PrintCompositor_CompositeDocumentToPdf_Params_Data();
    ~PrintCompositor_CompositeDocumentToPdf_Params_Data() = delete;
};
static_assert(sizeof(PrintCompositor_CompositeDocumentToPdf_Params_Data) == 32, "Bad sizeof(PrintCompositor_CompositeDocumentToPdf_Params_Data)");
class PrintCompositor_CompositeDocumentToPdf_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlySharedMemoryRegion_Data> pdf_region;

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_CompositeDocumentToPdf_ResponseParams_Data>;

    PrintCompositor_CompositeDocumentToPdf_ResponseParams_Data();
    ~PrintCompositor_CompositeDocumentToPdf_ResponseParams_Data() = delete;
};
static_assert(sizeof(PrintCompositor_CompositeDocumentToPdf_ResponseParams_Data) == 24, "Bad sizeof(PrintCompositor_CompositeDocumentToPdf_ResponseParams_Data)");
class PrintCompositor_PrepareForDocumentToPdf_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_PrepareForDocumentToPdf_Params_Data>;

    PrintCompositor_PrepareForDocumentToPdf_Params_Data();
    ~PrintCompositor_PrepareForDocumentToPdf_Params_Data() = delete;
};
static_assert(sizeof(PrintCompositor_PrepareForDocumentToPdf_Params_Data) == 8, "Bad sizeof(PrintCompositor_PrepareForDocumentToPdf_Params_Data)");
class PrintCompositor_PrepareForDocumentToPdf_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_PrepareForDocumentToPdf_ResponseParams_Data>;

    PrintCompositor_PrepareForDocumentToPdf_ResponseParams_Data();
    ~PrintCompositor_PrepareForDocumentToPdf_ResponseParams_Data() = delete;
};
static_assert(sizeof(PrintCompositor_PrepareForDocumentToPdf_ResponseParams_Data) == 16, "Bad sizeof(PrintCompositor_PrepareForDocumentToPdf_ResponseParams_Data)");
class PrintCompositor_CompleteDocumentToPdf_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t pages_count;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_CompleteDocumentToPdf_Params_Data>;

    PrintCompositor_CompleteDocumentToPdf_Params_Data();
    ~PrintCompositor_CompleteDocumentToPdf_Params_Data() = delete;
};
static_assert(sizeof(PrintCompositor_CompleteDocumentToPdf_Params_Data) == 16, "Bad sizeof(PrintCompositor_CompleteDocumentToPdf_Params_Data)");
class PrintCompositor_CompleteDocumentToPdf_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t status;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::mojo_base::mojom::internal::ReadOnlySharedMemoryRegion_Data> pdf_region;

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_CompleteDocumentToPdf_ResponseParams_Data>;

    PrintCompositor_CompleteDocumentToPdf_ResponseParams_Data();
    ~PrintCompositor_CompleteDocumentToPdf_ResponseParams_Data() = delete;
};
static_assert(sizeof(PrintCompositor_CompleteDocumentToPdf_ResponseParams_Data) == 24, "Bad sizeof(PrintCompositor_CompleteDocumentToPdf_ResponseParams_Data)");
class PrintCompositor_SetWebContentsURL_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_SetWebContentsURL_Params_Data>;

    PrintCompositor_SetWebContentsURL_Params_Data();
    ~PrintCompositor_SetWebContentsURL_Params_Data() = delete;
};
static_assert(sizeof(PrintCompositor_SetWebContentsURL_Params_Data) == 16, "Bad sizeof(PrintCompositor_SetWebContentsURL_Params_Data)");
class PrintCompositor_SetUserAgent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> user_agent;

private:
    friend class mojo::internal::MessageFragment<PrintCompositor_SetUserAgent_Params_Data>;

    PrintCompositor_SetUserAgent_Params_Data();
    ~PrintCompositor_SetUserAgent_Params_Data() = delete;
};
static_assert(sizeof(PrintCompositor_SetUserAgent_Params_Data) == 16, "Bad sizeof(PrintCompositor_SetUserAgent_Params_Data)");

} // namespace internal
class PrintCompositor_SetDiscardableSharedMemoryManager_ParamsDataView {
public:
    PrintCompositor_SetDiscardableSharedMemoryManager_ParamsDataView() = default;

    PrintCompositor_SetDiscardableSharedMemoryManager_ParamsDataView(internal::PrintCompositor_SetDiscardableSharedMemoryManager_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const { return !data_; }
    template <typename UserType> UserType TakeManager()
    {
        UserType result;
        bool ret
            = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::discardable_memory::mojom::DiscardableSharedMemoryManagerInterfaceBase>>(&data_->manager, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
