// third_party/blink/public/mojom/speech/speech_recognizer.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_SPEECH_SPEECH_RECOGNIZER_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_SPEECH_SPEECH_RECOGNIZER_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}
namespace blink {
namespace mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SpeechRecognizer_Start_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::StartSpeechRecognitionRequestParams_Data> params;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognizer_Start_Params_Data>;

    SpeechRecognizer_Start_Params_Data();
    ~SpeechRecognizer_Start_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognizer_Start_Params_Data) == 16, "Bad sizeof(SpeechRecognizer_Start_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SpeechRecognitionSession_Abort_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionSession_Abort_Params_Data>;

    SpeechRecognitionSession_Abort_Params_Data();
    ~SpeechRecognitionSession_Abort_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionSession_Abort_Params_Data) == 8, "Bad sizeof(SpeechRecognitionSession_Abort_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SpeechRecognitionSession_StopCapture_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionSession_StopCapture_Params_Data>;

    SpeechRecognitionSession_StopCapture_Params_Data();
    ~SpeechRecognitionSession_StopCapture_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionSession_StopCapture_Params_Data) == 8, "Bad sizeof(SpeechRecognitionSession_StopCapture_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SpeechRecognitionSessionClient_ResultRetrieved_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::blink::mojom::internal::SpeechRecognitionResult_Data>>> results;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionSessionClient_ResultRetrieved_Params_Data>;

    SpeechRecognitionSessionClient_ResultRetrieved_Params_Data();
    ~SpeechRecognitionSessionClient_ResultRetrieved_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionSessionClient_ResultRetrieved_Params_Data) == 16, "Bad sizeof(SpeechRecognitionSessionClient_ResultRetrieved_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SpeechRecognitionSessionClient_ErrorOccurred_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::SpeechRecognitionError_Data> error;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionSessionClient_ErrorOccurred_Params_Data>;

    SpeechRecognitionSessionClient_ErrorOccurred_Params_Data();
    ~SpeechRecognitionSessionClient_ErrorOccurred_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionSessionClient_ErrorOccurred_Params_Data) == 16, "Bad sizeof(SpeechRecognitionSessionClient_ErrorOccurred_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SpeechRecognitionSessionClient_Started_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionSessionClient_Started_Params_Data>;

    SpeechRecognitionSessionClient_Started_Params_Data();
    ~SpeechRecognitionSessionClient_Started_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionSessionClient_Started_Params_Data) == 8, "Bad sizeof(SpeechRecognitionSessionClient_Started_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SpeechRecognitionSessionClient_AudioStarted_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionSessionClient_AudioStarted_Params_Data>;

    SpeechRecognitionSessionClient_AudioStarted_Params_Data();
    ~SpeechRecognitionSessionClient_AudioStarted_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionSessionClient_AudioStarted_Params_Data) == 8, "Bad sizeof(SpeechRecognitionSessionClient_AudioStarted_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SpeechRecognitionSessionClient_SoundStarted_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionSessionClient_SoundStarted_Params_Data>;

    SpeechRecognitionSessionClient_SoundStarted_Params_Data();
    ~SpeechRecognitionSessionClient_SoundStarted_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionSessionClient_SoundStarted_Params_Data) == 8, "Bad sizeof(SpeechRecognitionSessionClient_SoundStarted_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SpeechRecognitionSessionClient_SoundEnded_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionSessionClient_SoundEnded_Params_Data>;

    SpeechRecognitionSessionClient_SoundEnded_Params_Data();
    ~SpeechRecognitionSessionClient_SoundEnded_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionSessionClient_SoundEnded_Params_Data) == 8, "Bad sizeof(SpeechRecognitionSessionClient_SoundEnded_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SpeechRecognitionSessionClient_AudioEnded_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionSessionClient_AudioEnded_Params_Data>;

    SpeechRecognitionSessionClient_AudioEnded_Params_Data();
    ~SpeechRecognitionSessionClient_AudioEnded_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionSessionClient_AudioEnded_Params_Data) == 8, "Bad sizeof(SpeechRecognitionSessionClient_AudioEnded_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SpeechRecognitionSessionClient_Ended_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SpeechRecognitionSessionClient_Ended_Params_Data>;

    SpeechRecognitionSessionClient_Ended_Params_Data();
    ~SpeechRecognitionSessionClient_Ended_Params_Data() = delete;
};
static_assert(sizeof(SpeechRecognitionSessionClient_Ended_Params_Data) == 8, "Bad sizeof(SpeechRecognitionSessionClient_Ended_Params_Data)");

} // namespace internal
class SpeechRecognizer_Start_ParamsDataView {
public:
    SpeechRecognizer_Start_ParamsDataView() = default;

    SpeechRecognizer_Start_ParamsDataView(internal::SpeechRecognizer_Start_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const { return !data_; }
    inline void GetParamsDataView(StartSpeechRecognitionRequestParamsDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadParams(UserType* output)
    {

        auto* pointer = data_->params.Get();
        return mojo::internal::Deserialize<::blink::mojom::StartSpeechRecognitionRequestParamsDataView>(pointer, output, message_);
    }

private:
    internal::SpeechRecognizer_Start_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class SpeechRecognitionSession_Abort_ParamsDataView {
public:
    SpeechRecognitionSession_Abort_ParamsDataView() = default;

    SpeechRecognitionSession_Abort_ParamsDataView(internal::SpeechRecognitionSession_Abort_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const { return !data_; }

private:
    internal::SpeechRecognitionSession_Abort_Params_Data* data_ = nullptr;
};

class SpeechRecognitionSession_StopCapture_ParamsDataView {
public:
    SpeechRecognitionSession_StopCapture_ParamsDataView() = default;

    SpeechRecognitionSession_StopCapture_ParamsDataView(internal::SpeechRecognitionSession_StopCapture_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const { return !data_; }

private:
    internal::SpeechRecognitionSession_StopCapture_Params_Data* data_ = nullptr;
};

class SpeechRecognitionSessionClient_ResultRetrieved_ParamsDataView {
public:
    SpeechRecognitionSessionClient_ResultRetrieved_ParamsDataView() = default;

    SpeechRecognitionSessionClient_ResultRetrieved_ParamsDataView(internal::SpeechRecognitionSessionClient_ResultRetrieved_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const { return !data_; }
    inline void GetResultsDataView(mojo::ArrayDataView<::blink::mojom::SpeechRecognitionResultDataView>* output);

    template <typename UserType> [[nodiscard]] bool ReadResults(UserType* output)
    {

        auto* pointer = data_->results.Get();
        return mojo::internal::Deserialize<mojo::ArrayDataView<::blink::mojom::SpeechRecognitionResultDataView>>(pointer, output, message_);
    }

private:
    internal::SpeechRecognitionSessionClient_ResultRetrieved_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class SpeechRecognitionSessionClient_ErrorOccurred_ParamsDataView {
public:
    SpeechRecognitionSessionClient_ErrorOccurred_ParamsDataView() = default;

    SpeechRecognitionSessionClient_ErrorOccurred_ParamsDataView(internal::SpeechRecognitionSessionClient_ErrorOccurred_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const { return !data_; }
    inline void GetErrorDataView(::blink::mojom::SpeechRecognitionErrorDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadError(UserType* output)
    {

        auto* pointer = data_->error.Get();
        return mojo::internal::Deserialize<::blink::mojom::SpeechRecognitionErrorDataView>(pointer, output, message_);
    }

private:
    internal::SpeechRecognitionSessionClient_ErrorOccurred_Params_Data* data_ = nullptr;
    mojo::Message* message_ = nullptr;
};

class SpeechRecognitionSessionClient_Started_ParamsDataView {
public:
    SpeechRecognitionSessionClient_Started_ParamsDataView() = default;

    SpeechRecognitionSessionClient_Started_ParamsDataView(internal::SpeechRecognitionSessionClient_Started_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const { return !data_; }

private:
    internal::SpeechRecognitionSessionClient_Started_Params_Data* data_ = nullptr;
};

class SpeechRecognitionSessionClient_AudioStarted_ParamsDataView {
public:
    SpeechRecognitionSessionClient_AudioStarted_ParamsDataView() = default;

    SpeechRecognitionSessionClient_AudioStarted_ParamsDataView(internal::SpeechRecognitionSessionClient_AudioStarted_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const { return !data_; }

private:
    internal::SpeechRecognitionSessionClient_AudioStarted_Params_Data* data_ = nullptr;
};

class SpeechRecognitionSessionClient_SoundStarted_ParamsDataView {
public:
    SpeechRecognitionSessionClient_SoundStarted_ParamsDataView() = default;

    SpeechRecognitionSessionClient_SoundStarted_ParamsDataView(internal::SpeechRecognitionSessionClient_SoundStarted_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const { return !data_; }

private:
    internal::SpeechRecognitionSessionClient_SoundStarted_Params_Data* data_ = nullptr;
};

class SpeechRecognitionSessionClient_SoundEnded_ParamsDataView {
public:
    SpeechRecognitionSessionClient_SoundEnded_ParamsDataView() = default;

    SpeechRecognitionSessionClient_SoundEnded_ParamsDataView(internal::SpeechRecognitionSessionClient_SoundEnded_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const { return !data_; }

private:
    internal::SpeechRecognitionSessionClient_SoundEnded_Params_Data* data_ = nullptr;
};

class SpeechRecognitionSessionClient_AudioEnded_ParamsDataView {
public:
    SpeechRecognitionSessionClient_AudioEnded_ParamsDataView() = default;

    SpeechRecognitionSessionClient_AudioEnded_ParamsDataView(internal::SpeechRecognitionSessionClient_AudioEnded_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const { return !data_; }

private:
    internal::SpeechRecognitionSessionClient_AudioEnded_Params_Data* data_ = nullptr;
};

class SpeechRecognitionSessionClient_Ended_ParamsDataView {
public:
    SpeechRecognitionSessionClient_Ended_ParamsDataView() = default;

    SpeechRecognitionSessionClient_Ended_ParamsDataView(internal::SpeechRecognitionSessionClient_Ended_Params_Data* data, mojo::Message* message)
        : data_(data)
    {
    }

    bool is_null() const { return !data_; }

private:
    internal::SpeechRecognitionSessionClient_Ended_Params_Data* data_ = nullptr;
};
inline void SpeechRecognizer_Start_ParamsDataView::GetParamsDataView(StartSpeechRecognitionRequestParamsDataView* output)
{
    auto pointer = data_->params.Get();
    *output = StartSpeechRecognitionRequestParamsDataView(pointer, message_);
}
inline void SpeechRecognitionSessionClient_ResultRetrieved_ParamsDataView::GetResultsDataView(mojo::ArrayDataView<::blink::mojom::SpeechRecognitionResultDataView>* output)
{
    auto pointer = data_->results.Get();
    *output = mojo::ArrayDataView<::blink::mojom::SpeechRecognitionResultDataView>(pointer, message_);
}
inline void SpeechRecognitionSessionClient_ErrorOccurred_ParamsDataView::GetErrorDataView(::blink::mojom::SpeechRecognitionErrorDataView* output)
{
    auto pointer = data_->error.Get();
    *output = ::blink::mojom::SpeechRecognitionErrorDataView(pointer, message_);
}

} // namespace mojom
} // namespace blink

#if defined(__clang__)
#pragma clang diagnostic pop
#endif

#endif // THIRD_PARTY_BLINK_PUBLIC_MOJOM_SPEECH_SPEECH_RECOGNIZER_MOJOM_PARAMS_DATA_H_
