// third_party/blink/public/mojom/chromeos/system_extensions/window_management/cros_window_management.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not
// edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_CHROMEOS_SYSTEM_EXTENSIONS_WINDOW_MANAGEMENT_CROS_WINDOW_MANAGEMENT_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_CHROMEOS_SYSTEM_EXTENSIONS_WINDOW_MANAGEMENT_CROS_WINDOW_MANAGEMENT_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}
namespace blink {
namespace mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagementFactory_Create_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedEndpointHandle_Data receiver;
    mojo::internal::AssociatedInterface_Data observer_remote;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagementFactory_Create_Params_Data>;

    CrosWindowManagementFactory_Create_Params_Data();
    ~CrosWindowManagementFactory_Create_Params_Data() = delete;
};
static_assert(sizeof(CrosWindowManagementFactory_Create_Params_Data) == 24, "Bad sizeof(CrosWindowManagementFactory_Create_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagement_GetAllWindows_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagement_GetAllWindows_Params_Data>;

    CrosWindowManagement_GetAllWindows_Params_Data();
    ~CrosWindowManagement_GetAllWindows_Params_Data() = delete;
};
static_assert(sizeof(CrosWindowManagement_GetAllWindows_Params_Data) == 8, "Bad sizeof(CrosWindowManagement_GetAllWindows_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagement_GetAllWindows_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::CrosWindowInfo_Data>>> result;

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagement_GetAllWindows_ResponseParams_Data>;

    CrosWindowManagement_GetAllWindows_ResponseParams_Data();
    ~CrosWindowManagement_GetAllWindows_ResponseParams_Data() = delete;
};
static_assert(sizeof(CrosWindowManagement_GetAllWindows_ResponseParams_Data) == 16, "Bad sizeof(CrosWindowManagement_GetAllWindows_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagement_MoveTo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> id;
    int32_t x;
    int32_t y;

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagement_MoveTo_Params_Data>;

    CrosWindowManagement_MoveTo_Params_Data();
    ~CrosWindowManagement_MoveTo_Params_Data() = delete;
};
static_assert(sizeof(CrosWindowManagement_MoveTo_Params_Data) == 24, "Bad sizeof(CrosWindowManagement_MoveTo_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagement_MoveTo_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t value;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagement_MoveTo_ResponseParams_Data>;

    CrosWindowManagement_MoveTo_ResponseParams_Data();
    ~CrosWindowManagement_MoveTo_ResponseParams_Data() = delete;
};
static_assert(sizeof(CrosWindowManagement_MoveTo_ResponseParams_Data) == 16, "Bad sizeof(CrosWindowManagement_MoveTo_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagement_MoveBy_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> id;
    int32_t delta_x;
    int32_t delta_y;

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagement_MoveBy_Params_Data>;

    CrosWindowManagement_MoveBy_Params_Data();
    ~CrosWindowManagement_MoveBy_Params_Data() = delete;
};
static_assert(sizeof(CrosWindowManagement_MoveBy_Params_Data) == 24, "Bad sizeof(CrosWindowManagement_MoveBy_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagement_MoveBy_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t value;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagement_MoveBy_ResponseParams_Data>;

    CrosWindowManagement_MoveBy_ResponseParams_Data();
    ~CrosWindowManagement_MoveBy_ResponseParams_Data() = delete;
};
static_assert(sizeof(CrosWindowManagement_MoveBy_ResponseParams_Data) == 16, "Bad sizeof(CrosWindowManagement_MoveBy_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagement_ResizeTo_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> id;
    int32_t width;
    int32_t height;

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagement_ResizeTo_Params_Data>;

    CrosWindowManagement_ResizeTo_Params_Data();
    ~CrosWindowManagement_ResizeTo_Params_Data() = delete;
};
static_assert(sizeof(CrosWindowManagement_ResizeTo_Params_Data) == 24, "Bad sizeof(CrosWindowManagement_ResizeTo_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagement_ResizeTo_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t value;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagement_ResizeTo_ResponseParams_Data>;

    CrosWindowManagement_ResizeTo_ResponseParams_Data();
    ~CrosWindowManagement_ResizeTo_ResponseParams_Data() = delete;
};
static_assert(sizeof(CrosWindowManagement_ResizeTo_ResponseParams_Data) == 16, "Bad sizeof(CrosWindowManagement_ResizeTo_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagement_ResizeBy_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> id;
    int32_t delta_width;
    int32_t delta_height;

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagement_ResizeBy_Params_Data>;

    CrosWindowManagement_ResizeBy_Params_Data();
    ~CrosWindowManagement_ResizeBy_Params_Data() = delete;
};
static_assert(sizeof(CrosWindowManagement_ResizeBy_Params_Data) == 24, "Bad sizeof(CrosWindowManagement_ResizeBy_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagement_ResizeBy_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t value;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagement_ResizeBy_ResponseParams_Data>;

    CrosWindowManagement_ResizeBy_ResponseParams_Data();
    ~CrosWindowManagement_ResizeBy_ResponseParams_Data() = delete;
};
static_assert(sizeof(CrosWindowManagement_ResizeBy_ResponseParams_Data) == 16, "Bad sizeof(CrosWindowManagement_ResizeBy_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagement_SetFullscreen_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> id;
    uint8_t fullscreen : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagement_SetFullscreen_Params_Data>;

    CrosWindowManagement_SetFullscreen_Params_Data();
    ~CrosWindowManagement_SetFullscreen_Params_Data() = delete;
};
static_assert(sizeof(CrosWindowManagement_SetFullscreen_Params_Data) == 24, "Bad sizeof(CrosWindowManagement_SetFullscreen_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagement_SetFullscreen_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t value;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagement_SetFullscreen_ResponseParams_Data>;

    CrosWindowManagement_SetFullscreen_ResponseParams_Data();
    ~CrosWindowManagement_SetFullscreen_ResponseParams_Data() = delete;
};
static_assert(sizeof(CrosWindowManagement_SetFullscreen_ResponseParams_Data) == 16, "Bad sizeof(CrosWindowManagement_SetFullscreen_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagement_Maximize_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> id;

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagement_Maximize_Params_Data>;

    CrosWindowManagement_Maximize_Params_Data();
    ~CrosWindowManagement_Maximize_Params_Data() = delete;
};
static_assert(sizeof(CrosWindowManagement_Maximize_Params_Data) == 16, "Bad sizeof(CrosWindowManagement_Maximize_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagement_Maximize_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t value;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagement_Maximize_ResponseParams_Data>;

    CrosWindowManagement_Maximize_ResponseParams_Data();
    ~CrosWindowManagement_Maximize_ResponseParams_Data() = delete;
};
static_assert(sizeof(CrosWindowManagement_Maximize_ResponseParams_Data) == 16, "Bad sizeof(CrosWindowManagement_Maximize_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagement_Minimize_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> id;

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagement_Minimize_Params_Data>;

    CrosWindowManagement_Minimize_Params_Data();
    ~CrosWindowManagement_Minimize_Params_Data() = delete;
};
static_assert(sizeof(CrosWindowManagement_Minimize_Params_Data) == 16, "Bad sizeof(CrosWindowManagement_Minimize_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagement_Minimize_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t value;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagement_Minimize_ResponseParams_Data>;

    CrosWindowManagement_Minimize_ResponseParams_Data();
    ~CrosWindowManagement_Minimize_ResponseParams_Data() = delete;
};
static_assert(sizeof(CrosWindowManagement_Minimize_ResponseParams_Data) == 16, "Bad sizeof(CrosWindowManagement_Minimize_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagement_Restore_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> id;

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagement_Restore_Params_Data>;

    CrosWindowManagement_Restore_Params_Data();
    ~CrosWindowManagement_Restore_Params_Data() = delete;
};
static_assert(sizeof(CrosWindowManagement_Restore_Params_Data) == 16, "Bad sizeof(CrosWindowManagement_Restore_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagement_Restore_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t value;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagement_Restore_ResponseParams_Data>;

    CrosWindowManagement_Restore_ResponseParams_Data();
    ~CrosWindowManagement_Restore_ResponseParams_Data() = delete;
};
static_assert(sizeof(CrosWindowManagement_Restore_ResponseParams_Data) == 16, "Bad sizeof(CrosWindowManagement_Restore_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagement_Focus_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> id;

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagement_Focus_Params_Data>;

    CrosWindowManagement_Focus_Params_Data();
    ~CrosWindowManagement_Focus_Params_Data() = delete;
};
static_assert(sizeof(CrosWindowManagement_Focus_Params_Data) == 16, "Bad sizeof(CrosWindowManagement_Focus_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagement_Focus_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t value;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagement_Focus_ResponseParams_Data>;

    CrosWindowManagement_Focus_ResponseParams_Data();
    ~CrosWindowManagement_Focus_ResponseParams_Data() = delete;
};
static_assert(sizeof(CrosWindowManagement_Focus_ResponseParams_Data) == 16, "Bad sizeof(CrosWindowManagement_Focus_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagement_Close_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> id;

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagement_Close_Params_Data>;

    CrosWindowManagement_Close_Params_Data();
    ~CrosWindowManagement_Close_Params_Data() = delete;
};
static_assert(sizeof(CrosWindowManagement_Close_Params_Data) == 16, "Bad sizeof(CrosWindowManagement_Close_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagement_Close_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t value;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagement_Close_ResponseParams_Data>;

    CrosWindowManagement_Close_ResponseParams_Data();
    ~CrosWindowManagement_Close_ResponseParams_Data() = delete;
};
static_assert(sizeof(CrosWindowManagement_Close_ResponseParams_Data) == 16, "Bad sizeof(CrosWindowManagement_Close_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagement_GetAllScreens_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagement_GetAllScreens_Params_Data>;

    CrosWindowManagement_GetAllScreens_Params_Data();
    ~CrosWindowManagement_GetAllScreens_Params_Data() = delete;
};
static_assert(sizeof(CrosWindowManagement_GetAllScreens_Params_Data) == 8, "Bad sizeof(CrosWindowManagement_GetAllScreens_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagement_GetAllScreens_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::CrosScreenInfo_Data>>> screens;

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagement_GetAllScreens_ResponseParams_Data>;

    CrosWindowManagement_GetAllScreens_ResponseParams_Data();
    ~CrosWindowManagement_GetAllScreens_ResponseParams_Data() = delete;
};
static_assert(sizeof(CrosWindowManagement_GetAllScreens_ResponseParams_Data) == 16, "Bad sizeof(CrosWindowManagement_GetAllScreens_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagementObserver_DispatchStartEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagementObserver_DispatchStartEvent_Params_Data>;

    CrosWindowManagementObserver_DispatchStartEvent_Params_Data();
    ~CrosWindowManagementObserver_DispatchStartEvent_Params_Data() = delete;
};
static_assert(sizeof(CrosWindowManagementObserver_DispatchStartEvent_Params_Data) == 8, "Bad sizeof(CrosWindowManagementObserver_DispatchStartEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagementObserver_DispatchAcceleratorEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::AcceleratorEvent_Data> event;

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagementObserver_DispatchAcceleratorEvent_Params_Data>;

    CrosWindowManagementObserver_DispatchAcceleratorEvent_Params_Data();
    ~CrosWindowManagementObserver_DispatchAcceleratorEvent_Params_Data() = delete;
};
static_assert(sizeof(CrosWindowManagementObserver_DispatchAcceleratorEvent_Params_Data) == 16, "Bad sizeof(CrosWindowManagementObserver_DispatchAcceleratorEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagementObserver_DispatchWindowOpenedEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::CrosWindowInfo_Data> window;

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagementObserver_DispatchWindowOpenedEvent_Params_Data>;

    CrosWindowManagementObserver_DispatchWindowOpenedEvent_Params_Data();
    ~CrosWindowManagementObserver_DispatchWindowOpenedEvent_Params_Data() = delete;
};
static_assert(sizeof(CrosWindowManagementObserver_DispatchWindowOpenedEvent_Params_Data) == 16, "Bad sizeof(CrosWindowManagementObserver_DispatchWindowOpenedEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) CrosWindowManagementObserver_DispatchWindowClosedEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::CrosWindowInfo_Data> window;

private:
    friend class mojo::internal::MessageFragment<CrosWindowManagementObserver_DispatchWindowClosedEvent_Params_Data>;

    CrosWindowManagementObserver_DispatchWindowClosedEvent_Params_Data();
    ~CrosWindowManagementObserver_DispatchWindowClosedEvent_Params_Data() = delete;
};
static_assert(sizeof(CrosWindowManagementObserver_DispatchWindowClosedEvent_Params_Data) == 16, "Bad sizeof(CrosWindowManagementObserver_DispatchWindowClosedEvent_Params_Data)");

} // namespace internal
class CrosWindowManagementFactory_Create_ParamsDataView {
public:
    CrosWindowManagementFactory_Create_ParamsDataView() = default;

    CrosWindowManagementFactory_Create_ParamsDataView(internal::CrosWindowManagementFactory_Create_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const { return !data_; }
    template <typename UserType> UserType TakeReceiver()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<::blink::mojom::CrosWindowManagementAssociatedRequestDataView>(&data_->receiver, &result, message_);
        DCHECK(ret);
        return result;
    }
    template <typename UserType> UserType TakeObserverRemote()
    {
        UserType result;
