// third_party/blink/public/mojom/shared_storage/shared_storage.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_SHARED_STORAGE_SHARED_STORAGE_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_SHARED_STORAGE_SHARED_STORAGE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}
namespace blink {
namespace mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageDocumentService_AddModuleOnWorklet_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> script_source_url;

private:
    friend class mojo::internal::MessageFragment<SharedStorageDocumentService_AddModuleOnWorklet_Params_Data>;

    SharedStorageDocumentService_AddModuleOnWorklet_Params_Data();
    ~SharedStorageDocumentService_AddModuleOnWorklet_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageDocumentService_AddModuleOnWorklet_Params_Data) == 16, "Bad sizeof(SharedStorageDocumentService_AddModuleOnWorklet_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageDocumentService_AddModuleOnWorklet_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<mojo::internal::String_Data> error_message;

private:
    friend class mojo::internal::MessageFragment<SharedStorageDocumentService_AddModuleOnWorklet_ResponseParams_Data>;

    SharedStorageDocumentService_AddModuleOnWorklet_ResponseParams_Data();
    ~SharedStorageDocumentService_AddModuleOnWorklet_ResponseParams_Data() = delete;
};
static_assert(sizeof(SharedStorageDocumentService_AddModuleOnWorklet_ResponseParams_Data) == 24, "Bad sizeof(SharedStorageDocumentService_AddModuleOnWorklet_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageDocumentService_RunOperationOnWorklet_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> name;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> serialized_data;

private:
    friend class mojo::internal::MessageFragment<SharedStorageDocumentService_RunOperationOnWorklet_Params_Data>;

    SharedStorageDocumentService_RunOperationOnWorklet_Params_Data();
    ~SharedStorageDocumentService_RunOperationOnWorklet_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageDocumentService_RunOperationOnWorklet_Params_Data) == 24, "Bad sizeof(SharedStorageDocumentService_RunOperationOnWorklet_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageDocumentService_RunOperationOnWorklet_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<mojo::internal::String_Data> error_message;

private:
    friend class mojo::internal::MessageFragment<SharedStorageDocumentService_RunOperationOnWorklet_ResponseParams_Data>;

    SharedStorageDocumentService_RunOperationOnWorklet_ResponseParams_Data();
    ~SharedStorageDocumentService_RunOperationOnWorklet_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(SharedStorageDocumentService_RunOperationOnWorklet_ResponseParams_Data) == 24, "Bad sizeof(SharedStorageDocumentService_RunOperationOnWorklet_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageDocumentService_RunURLSelectionOperationOnWorklet_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> name;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<internal::SharedStorageUrlWithMetadata_Data>>> urls_with_metadata;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint8_t>> serialized_data;

private:
    friend class mojo::internal::MessageFragment<SharedStorageDocumentService_RunURLSelectionOperationOnWorklet_Params_Data>;

    SharedStorageDocumentService_RunURLSelectionOperationOnWorklet_Params_Data();
    ~SharedStorageDocumentService_RunURLSelectionOperationOnWorklet_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageDocumentService_RunURLSelectionOperationOnWorklet_Params_Data) == 32,
    "Bad sizeof(SharedStorageDocumentService_RunURLSelectionOperationOnWorklet_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageDocumentService_RunURLSelectionOperationOnWorklet_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<mojo::internal::String_Data> error_message;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> opaque_url;

private:
    friend class mojo::internal::MessageFragment<SharedStorageDocumentService_RunURLSelectionOperationOnWorklet_ResponseParams_Data>;

    SharedStorageDocumentService_RunURLSelectionOperationOnWorklet_ResponseParams_Data();
    ~SharedStorageDocumentService_RunURLSelectionOperationOnWorklet_ResponseParams_Data() = delete;
};
static_assert(sizeof(SharedStorageDocumentService_RunURLSelectionOperationOnWorklet_ResponseParams_Data) == 32,
    "Bad sizeof(SharedStorageDocumentService_RunURLSelectionOperationOnWorklet_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageDocumentService_SharedStorageSet_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::SharedStorageKeyArgument_Data> key;
    mojo::internal::Pointer<internal::SharedStorageValueArgument_Data> value;
    uint8_t ignore_if_present : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<SharedStorageDocumentService_SharedStorageSet_Params_Data>;

    SharedStorageDocumentService_SharedStorageSet_Params_Data();
    ~SharedStorageDocumentService_SharedStorageSet_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageDocumentService_SharedStorageSet_Params_Data) == 32, "Bad sizeof(SharedStorageDocumentService_SharedStorageSet_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageDocumentService_SharedStorageSet_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<mojo::internal::String_Data> error_message;

private:
    friend class mojo::internal::MessageFragment<SharedStorageDocumentService_SharedStorageSet_ResponseParams_Data>;

    SharedStorageDocumentService_SharedStorageSet_ResponseParams_Data();
    ~SharedStorageDocumentService_SharedStorageSet_ResponseParams_Data() = delete;
};
static_assert(sizeof(SharedStorageDocumentService_SharedStorageSet_ResponseParams_Data) == 24, "Bad sizeof(SharedStorageDocumentService_SharedStorageSet_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageDocumentService_SharedStorageAppend_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::SharedStorageKeyArgument_Data> key;
    mojo::internal::Pointer<internal::SharedStorageValueArgument_Data> value;

private:
    friend class mojo::internal::MessageFragment<SharedStorageDocumentService_SharedStorageAppend_Params_Data>;

    SharedStorageDocumentService_SharedStorageAppend_Params_Data();
    ~SharedStorageDocumentService_SharedStorageAppend_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageDocumentService_SharedStorageAppend_Params_Data) == 24, "Bad sizeof(SharedStorageDocumentService_SharedStorageAppend_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageDocumentService_SharedStorageAppend_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<mojo::internal::String_Data> error_message;

private:
    friend class mojo::internal::MessageFragment<SharedStorageDocumentService_SharedStorageAppend_ResponseParams_Data>;

    SharedStorageDocumentService_SharedStorageAppend_ResponseParams_Data();
    ~SharedStorageDocumentService_SharedStorageAppend_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(SharedStorageDocumentService_SharedStorageAppend_ResponseParams_Data) == 24, "Bad sizeof(SharedStorageDocumentService_SharedStorageAppend_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageDocumentService_SharedStorageDelete_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::SharedStorageKeyArgument_Data> key;

private:
    friend class mojo::internal::MessageFragment<SharedStorageDocumentService_SharedStorageDelete_Params_Data>;

    SharedStorageDocumentService_SharedStorageDelete_Params_Data();
    ~SharedStorageDocumentService_SharedStorageDelete_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageDocumentService_SharedStorageDelete_Params_Data) == 16, "Bad sizeof(SharedStorageDocumentService_SharedStorageDelete_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageDocumentService_SharedStorageDelete_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<mojo::internal::String_Data> error_message;

private:
    friend class mojo::internal::MessageFragment<SharedStorageDocumentService_SharedStorageDelete_ResponseParams_Data>;

    SharedStorageDocumentService_SharedStorageDelete_ResponseParams_Data();
    ~SharedStorageDocumentService_SharedStorageDelete_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(SharedStorageDocumentService_SharedStorageDelete_ResponseParams_Data) == 24, "Bad sizeof(SharedStorageDocumentService_SharedStorageDelete_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageDocumentService_SharedStorageClear_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<SharedStorageDocumentService_SharedStorageClear_Params_Data>;

    SharedStorageDocumentService_SharedStorageClear_Params_Data();
    ~SharedStorageDocumentService_SharedStorageClear_Params_Data() = delete;
};
static_assert(sizeof(SharedStorageDocumentService_SharedStorageClear_Params_Data) == 8, "Bad sizeof(SharedStorageDocumentService_SharedStorageClear_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) SharedStorageDocumentService_SharedStorageClear_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<mojo::internal::String_Data> error_message;

private:
    friend class mojo::internal::MessageFragment<SharedStorageDocumentService_SharedStorageClear_ResponseParams_Data>;

    SharedStorageDocumentService_SharedStorageClear_ResponseParams_Data();
    ~SharedStorageDocumentService_SharedStorageClear_ResponseParams_Data() = delete;
};
static_assert(sizeof(SharedStorageDocumentService_SharedStorageClear_ResponseParams_Data) == 24, "Bad sizeof(SharedStorageDocumentService_SharedStorageClear_ResponseParams_Data)");

} // namespace internal
class SharedStorageDocumentService_AddModuleOnWorklet_ParamsDataView {
public:
    SharedStorageDocumentService_AddModuleOnWorklet_ParamsDataView() = default;

    SharedStorageDocumentService_AddModuleOnWorklet_ParamsDataView(internal::SharedStorageDocumentService_AddModuleOnWorklet_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const { return !data_; }
    inline void GetScriptSourceUrlDataView(::url::mojom::UrlDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadScriptSourceUrl(UserType* output)
    {

        auto* pointer = data_->script_source_url.Get();
        return mojo::internal::Deserialize<::url::mojom::UrlDataView>(pointer, output, message_);
    }

private:
