// components/services/storage/privileged/mojom/indexed_db_control.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_SERVICES_STORAGE_PRIVILEGED_MOJOM_INDEXED_DB_CONTROL_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_SERVICES_STORAGE_PRIVILEGED_MOJOM_INDEXED_DB_CONTROL_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}
namespace storage {
namespace mojom {
namespace internal {
class IndexedDBObserver_OnIndexedDBListChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::storage::mojom::internal::BucketLocator_Data> bucket_locator;

private:
    friend class mojo::internal::MessageFragment<IndexedDBObserver_OnIndexedDBListChanged_Params_Data>;

    IndexedDBObserver_OnIndexedDBListChanged_Params_Data();
    ~IndexedDBObserver_OnIndexedDBListChanged_Params_Data() = delete;
};
static_assert(sizeof(IndexedDBObserver_OnIndexedDBListChanged_Params_Data) == 16, "Bad sizeof(IndexedDBObserver_OnIndexedDBListChanged_Params_Data)");
class IndexedDBObserver_OnIndexedDBContentChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::storage::mojom::internal::BucketLocator_Data> bucket_locator;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> database_name;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> object_store_name;

private:
    friend class mojo::internal::MessageFragment<IndexedDBObserver_OnIndexedDBContentChanged_Params_Data>;

    IndexedDBObserver_OnIndexedDBContentChanged_Params_Data();
    ~IndexedDBObserver_OnIndexedDBContentChanged_Params_Data() = delete;
};
static_assert(sizeof(IndexedDBObserver_OnIndexedDBContentChanged_Params_Data) == 32, "Bad sizeof(IndexedDBObserver_OnIndexedDBContentChanged_Params_Data)");
class IndexedDBControl_BindIndexedDB_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::StorageKey_Data> storage_key;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<IndexedDBControl_BindIndexedDB_Params_Data>;

    IndexedDBControl_BindIndexedDB_Params_Data();
    ~IndexedDBControl_BindIndexedDB_Params_Data() = delete;
};
static_assert(sizeof(IndexedDBControl_BindIndexedDB_Params_Data) == 24, "Bad sizeof(IndexedDBControl_BindIndexedDB_Params_Data)");
class IndexedDBControl_BindIndexedDBForBucket_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::storage::mojom::internal::BucketLocator_Data> bucket_locator;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<IndexedDBControl_BindIndexedDBForBucket_Params_Data>;

    IndexedDBControl_BindIndexedDBForBucket_Params_Data();
    ~IndexedDBControl_BindIndexedDBForBucket_Params_Data() = delete;
};
static_assert(sizeof(IndexedDBControl_BindIndexedDBForBucket_Params_Data) == 24, "Bad sizeof(IndexedDBControl_BindIndexedDBForBucket_Params_Data)");
class IndexedDBControl_GetUsage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControl_GetUsage_Params_Data>;

    IndexedDBControl_GetUsage_Params_Data();
    ~IndexedDBControl_GetUsage_Params_Data() = delete;
};
static_assert(sizeof(IndexedDBControl_GetUsage_Params_Data) == 8, "Bad sizeof(IndexedDBControl_GetUsage_Params_Data)");
class IndexedDBControl_GetUsage_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::storage::mojom::internal::StorageUsageInfo_Data>>> info;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControl_GetUsage_ResponseParams_Data>;

    IndexedDBControl_GetUsage_ResponseParams_Data();
    ~IndexedDBControl_GetUsage_ResponseParams_Data() = delete;
};
static_assert(sizeof(IndexedDBControl_GetUsage_ResponseParams_Data) == 16, "Bad sizeof(IndexedDBControl_GetUsage_ResponseParams_Data)");
class IndexedDBControl_DeleteForStorageKey_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::StorageKey_Data> storage_key;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControl_DeleteForStorageKey_Params_Data>;

    IndexedDBControl_DeleteForStorageKey_Params_Data();
    ~IndexedDBControl_DeleteForStorageKey_Params_Data() = delete;
};
static_assert(sizeof(IndexedDBControl_DeleteForStorageKey_Params_Data) == 16, "Bad sizeof(IndexedDBControl_DeleteForStorageKey_Params_Data)");
class IndexedDBControl_DeleteForStorageKey_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<IndexedDBControl_DeleteForStorageKey_ResponseParams_Data>;

    IndexedDBControl_DeleteForStorageKey_ResponseParams_Data();
    ~IndexedDBControl_DeleteForStorageKey_ResponseParams_Data() = delete;
};
static_assert(sizeof(IndexedDBControl_DeleteForStorageKey_ResponseParams_Data) == 16, "Bad sizeof(IndexedDBControl_DeleteForStorageKey_ResponseParams_Data)");
class IndexedDBControl_ForceClose_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::storage::mojom::internal::BucketId_Data> bucket_id;
    int32_t reason;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<IndexedDBControl_ForceClose_Params_Data>;

    IndexedDBControl_ForceClose_Params_Data();
    ~IndexedDBControl_ForceClose_Params_Data() = delete;
};
static_assert(sizeof(IndexedDBControl_ForceClose_Params_Data) == 24, "Bad sizeof(IndexedDBControl_ForceClose_Params_Data)");
class IndexedDBControl_ForceClose_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControl_ForceClose_ResponseParams_Data>;

    IndexedDBControl_ForceClose_ResponseParams_Data();
    ~IndexedDBControl_ForceClose_ResponseParams_Data() = delete;
};
static_assert(sizeof(IndexedDBControl_ForceClose_ResponseParams_Data) == 8, "Bad sizeof(IndexedDBControl_ForceClose_ResponseParams_Data)");
class IndexedDBControl_GetConnectionCount_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::storage::mojom::internal::BucketId_Data> bucket_id;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControl_GetConnectionCount_Params_Data>;

    IndexedDBControl_GetConnectionCount_Params_Data();
    ~IndexedDBControl_GetConnectionCount_Params_Data() = delete;
};
static_assert(sizeof(IndexedDBControl_GetConnectionCount_Params_Data) == 16, "Bad sizeof(IndexedDBControl_GetConnectionCount_Params_Data)");
class IndexedDBControl_GetConnectionCount_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint64_t connection_count;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControl_GetConnectionCount_ResponseParams_Data>;

    IndexedDBControl_GetConnectionCount_ResponseParams_Data();
    ~IndexedDBControl_GetConnectionCount_ResponseParams_Data() = delete;
};
static_assert(sizeof(IndexedDBControl_GetConnectionCount_ResponseParams_Data) == 16, "Bad sizeof(IndexedDBControl_GetConnectionCount_ResponseParams_Data)");
class IndexedDBControl_DownloadBucketData_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::storage::mojom::internal::BucketId_Data> bucket_id;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControl_DownloadBucketData_Params_Data>;

    IndexedDBControl_DownloadBucketData_Params_Data();
    ~IndexedDBControl_DownloadBucketData_Params_Data() = delete;
};
static_assert(sizeof(IndexedDBControl_DownloadBucketData_Params_Data) == 16, "Bad sizeof(IndexedDBControl_DownloadBucketData_Params_Data)");
class IndexedDBControl_DownloadBucketData_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data> temp_path;
    mojo::internal::Pointer<::mojo_base::mojom::internal::FilePath_Data> zip_path;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControl_DownloadBucketData_ResponseParams_Data>;

    IndexedDBControl_DownloadBucketData_ResponseParams_Data();
    ~IndexedDBControl_DownloadBucketData_ResponseParams_Data() = delete;
};
static_assert(sizeof(IndexedDBControl_DownloadBucketData_ResponseParams_Data) == 32, "Bad sizeof(IndexedDBControl_DownloadBucketData_ResponseParams_Data)");
class IndexedDBControl_GetAllBucketsDetails_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControl_GetAllBucketsDetails_Params_Data>;

    IndexedDBControl_GetAllBucketsDetails_Params_Data();
    ~IndexedDBControl_GetAllBucketsDetails_Params_Data() = delete;
};
static_assert(sizeof(IndexedDBControl_GetAllBucketsDetails_Params_Data) == 8, "Bad sizeof(IndexedDBControl_GetAllBucketsDetails_Params_Data)");
class IndexedDBControl_GetAllBucketsDetails_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t incognito : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<::mojo_base::mojom::internal::ListValue_Data> details;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControl_GetAllBucketsDetails_ResponseParams_Data>;

    IndexedDBControl_GetAllBucketsDetails_ResponseParams_Data();
    ~IndexedDBControl_GetAllBucketsDetails_ResponseParams_Data() = delete;
};
static_assert(sizeof(IndexedDBControl_GetAllBucketsDetails_ResponseParams_Data) == 24, "Bad sizeof(IndexedDBControl_GetAllBucketsDetails_ResponseParams_Data)");
class IndexedDBControl_SetForceKeepSessionState_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControl_SetForceKeepSessionState_Params_Data>;

    IndexedDBControl_SetForceKeepSessionState_Params_Data();
    ~IndexedDBControl_SetForceKeepSessionState_Params_Data() = delete;
};
static_assert(sizeof(IndexedDBControl_SetForceKeepSessionState_Params_Data) == 8, "Bad sizeof(IndexedDBControl_SetForceKeepSessionState_Params_Data)");
class IndexedDBControl_AddObserver_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data observer;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControl_AddObserver_Params_Data>;

    IndexedDBControl_AddObserver_Params_Data();
    ~IndexedDBControl_AddObserver_Params_Data() = delete;
};
static_assert(sizeof(IndexedDBControl_AddObserver_Params_Data) == 16, "Bad sizeof(IndexedDBControl_AddObserver_Params_Data)");
class IndexedDBControl_ApplyPolicyUpdates_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::storage::mojom::internal::StoragePolicyUpdate_Data>>> policy_updates;

private:
    friend class mojo::internal::MessageFragment<IndexedDBControl_ApplyPolicyUpdates_Params_Data>;

    IndexedDBControl_ApplyPolicyUpdates_Params_Data();
    ~IndexedDBControl_ApplyPolicyUpdates_Params_Data() = delete;
};
static_assert(sizeof(IndexedDBControl_ApplyPolicyUpdates_Params_Data) == 16, "Bad sizeof(IndexedDBControl_ApplyPolicyUpdates_Params_Data)");
class IndexedDBControl_BindTestInterface_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<IndexedDBControl_BindTestInterface_Params_Data>;

    IndexedDBControl_BindTestInterface_Params_Data();
    ~IndexedDBControl_BindTestInterface_Params_Data() = delete;
};
static_assert(sizeof(IndexedDBControl_BindTestInterface_Params_Data) == 16, "Bad sizeof(IndexedDBControl_BindTestInterface_Params_Data)");

} // namespace internal
class IndexedDBObserver_OnIndexedDBListChanged_ParamsDataView {
public:
    IndexedDBObserver_OnIndexedDBListChanged_ParamsDataView() = default;

    IndexedDBObserver_OnIndexedDBListChanged_ParamsDataView(internal::IndexedDBObserver_OnIndexedDBListChanged_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const { return !data_; }
    inline void GetBucketLocatorDataView(::storage::mojom::BucketLocatorDataView* output);

    template <typename UserType> [[nodiscard]] bool ReadBucketLocator(UserType* output)
    {

        auto* pointer = data_->bucket_locator.Get();
        return mojo::internal::Deserialize<::storage::mojom::BucketLocatorDataView>(pointer, output, message_);
    }

private:
