// third_party/blink/public/mojom/frame/frame.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef THIRD_PARTY_BLINK_PUBLIC_MOJOM_FRAME_FRAME_MOJOM_PARAMS_DATA_H_
#define THIRD_PARTY_BLINK_PUBLIC_MOJOM_FRAME_FRAME_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}
namespace blink {
namespace mojom {
namespace internal {
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) KeepAliveHandleFactory_IssueKeepAliveHandle_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data keep_alive_handle;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<KeepAliveHandleFactory_IssueKeepAliveHandle_Params_Data>;

    KeepAliveHandleFactory_IssueKeepAliveHandle_Params_Data();
    ~KeepAliveHandleFactory_IssueKeepAliveHandle_Params_Data() = delete;
};
static_assert(sizeof(KeepAliveHandleFactory_IssueKeepAliveHandle_Params_Data) == 16, "Bad sizeof(KeepAliveHandleFactory_IssueKeepAliveHandle_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_EnterFullscreen_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FullscreenOptions_Data> options;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_EnterFullscreen_Params_Data>;

    LocalFrameHost_EnterFullscreen_Params_Data();
    ~LocalFrameHost_EnterFullscreen_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_EnterFullscreen_Params_Data) == 16, "Bad sizeof(LocalFrameHost_EnterFullscreen_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_EnterFullscreen_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t granted : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_EnterFullscreen_ResponseParams_Data>;

    LocalFrameHost_EnterFullscreen_ResponseParams_Data();
    ~LocalFrameHost_EnterFullscreen_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_EnterFullscreen_ResponseParams_Data) == 16, "Bad sizeof(LocalFrameHost_EnterFullscreen_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_ExitFullscreen_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_ExitFullscreen_Params_Data>;

    LocalFrameHost_ExitFullscreen_Params_Data();
    ~LocalFrameHost_ExitFullscreen_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_ExitFullscreen_Params_Data) == 8, "Bad sizeof(LocalFrameHost_ExitFullscreen_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_FullscreenStateChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t is_fullscreen : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<::blink::mojom::internal::FullscreenOptions_Data> options;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_FullscreenStateChanged_Params_Data>;

    LocalFrameHost_FullscreenStateChanged_Params_Data();
    ~LocalFrameHost_FullscreenStateChanged_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_FullscreenStateChanged_Params_Data) == 24, "Bad sizeof(LocalFrameHost_FullscreenStateChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_RegisterProtocolHandler_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> scheme;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    uint8_t user_gesture : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_RegisterProtocolHandler_Params_Data>;

    LocalFrameHost_RegisterProtocolHandler_Params_Data();
    ~LocalFrameHost_RegisterProtocolHandler_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_RegisterProtocolHandler_Params_Data) == 32, "Bad sizeof(LocalFrameHost_RegisterProtocolHandler_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_UnregisterProtocolHandler_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> scheme;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    uint8_t user_gesture : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_UnregisterProtocolHandler_Params_Data>;

    LocalFrameHost_UnregisterProtocolHandler_Params_Data();
    ~LocalFrameHost_UnregisterProtocolHandler_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_UnregisterProtocolHandler_Params_Data) == 32, "Bad sizeof(LocalFrameHost_UnregisterProtocolHandler_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidDisplayInsecureContent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidDisplayInsecureContent_Params_Data>;

    LocalFrameHost_DidDisplayInsecureContent_Params_Data();
    ~LocalFrameHost_DidDisplayInsecureContent_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidDisplayInsecureContent_Params_Data) == 8, "Bad sizeof(LocalFrameHost_DidDisplayInsecureContent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidContainInsecureFormAction_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidContainInsecureFormAction_Params_Data>;

    LocalFrameHost_DidContainInsecureFormAction_Params_Data();
    ~LocalFrameHost_DidContainInsecureFormAction_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidContainInsecureFormAction_Params_Data) == 8, "Bad sizeof(LocalFrameHost_DidContainInsecureFormAction_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_MainDocumentElementAvailable_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t uses_temporary_zoom_level : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_MainDocumentElementAvailable_Params_Data>;

    LocalFrameHost_MainDocumentElementAvailable_Params_Data();
    ~LocalFrameHost_MainDocumentElementAvailable_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_MainDocumentElementAvailable_Params_Data) == 16, "Bad sizeof(LocalFrameHost_MainDocumentElementAvailable_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_SetNeedsOcclusionTracking_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t needs_tracking : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_SetNeedsOcclusionTracking_Params_Data>;

    LocalFrameHost_SetNeedsOcclusionTracking_Params_Data();
    ~LocalFrameHost_SetNeedsOcclusionTracking_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_SetNeedsOcclusionTracking_Params_Data) == 16, "Bad sizeof(LocalFrameHost_SetNeedsOcclusionTracking_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_SetVirtualKeyboardMode_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_SetVirtualKeyboardMode_Params_Data>;

    LocalFrameHost_SetVirtualKeyboardMode_Params_Data();
    ~LocalFrameHost_SetVirtualKeyboardMode_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_SetVirtualKeyboardMode_Params_Data) == 16, "Bad sizeof(LocalFrameHost_SetVirtualKeyboardMode_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_VisibilityChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t visibility;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_VisibilityChanged_Params_Data>;

    LocalFrameHost_VisibilityChanged_Params_Data();
    ~LocalFrameHost_VisibilityChanged_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_VisibilityChanged_Params_Data) == 16, "Bad sizeof(LocalFrameHost_VisibilityChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidChangeThemeColor_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::skia::mojom::internal::SkColor_Data> theme_color;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidChangeThemeColor_Params_Data>;

    LocalFrameHost_DidChangeThemeColor_Params_Data();
    ~LocalFrameHost_DidChangeThemeColor_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidChangeThemeColor_Params_Data) == 16, "Bad sizeof(LocalFrameHost_DidChangeThemeColor_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidChangeBackgroundColor_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::skia::mojom::internal::SkColor_Data> background_color;
    uint8_t color_adjust : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidChangeBackgroundColor_Params_Data>;

    LocalFrameHost_DidChangeBackgroundColor_Params_Data();
    ~LocalFrameHost_DidChangeBackgroundColor_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidChangeBackgroundColor_Params_Data) == 24, "Bad sizeof(LocalFrameHost_DidChangeBackgroundColor_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidFailLoadWithError_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    int32_t error_code;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidFailLoadWithError_Params_Data>;

    LocalFrameHost_DidFailLoadWithError_Params_Data();
    ~LocalFrameHost_DidFailLoadWithError_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidFailLoadWithError_Params_Data) == 24, "Bad sizeof(LocalFrameHost_DidFailLoadWithError_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidFocusFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidFocusFrame_Params_Data>;

    LocalFrameHost_DidFocusFrame_Params_Data();
    ~LocalFrameHost_DidFocusFrame_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidFocusFrame_Params_Data) == 8, "Bad sizeof(LocalFrameHost_DidFocusFrame_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidCallFocus_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidCallFocus_Params_Data>;

    LocalFrameHost_DidCallFocus_Params_Data();
    ~LocalFrameHost_DidCallFocus_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidCallFocus_Params_Data) == 8, "Bad sizeof(LocalFrameHost_DidCallFocus_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_EnforceInsecureRequestPolicy_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t policy_bitmap;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_EnforceInsecureRequestPolicy_Params_Data>;

    LocalFrameHost_EnforceInsecureRequestPolicy_Params_Data();
    ~LocalFrameHost_EnforceInsecureRequestPolicy_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_EnforceInsecureRequestPolicy_Params_Data) == 16, "Bad sizeof(LocalFrameHost_EnforceInsecureRequestPolicy_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_EnforceInsecureNavigationsSet_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<uint32_t>> set;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_EnforceInsecureNavigationsSet_Params_Data>;

    LocalFrameHost_EnforceInsecureNavigationsSet_Params_Data();
    ~LocalFrameHost_EnforceInsecureNavigationsSet_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_EnforceInsecureNavigationsSet_Params_Data) == 16, "Bad sizeof(LocalFrameHost_EnforceInsecureNavigationsSet_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_SuddenTerminationDisablerChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t present : 1;
    uint8_t pad0_[3];
    int32_t disabler_type;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_SuddenTerminationDisablerChanged_Params_Data>;

    LocalFrameHost_SuddenTerminationDisablerChanged_Params_Data();
    ~LocalFrameHost_SuddenTerminationDisablerChanged_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_SuddenTerminationDisablerChanged_Params_Data) == 16, "Bad sizeof(LocalFrameHost_SuddenTerminationDisablerChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_HadStickyUserActivationBeforeNavigationChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t has_gesture : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_HadStickyUserActivationBeforeNavigationChanged_Params_Data>;

    LocalFrameHost_HadStickyUserActivationBeforeNavigationChanged_Params_Data();
    ~LocalFrameHost_HadStickyUserActivationBeforeNavigationChanged_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_HadStickyUserActivationBeforeNavigationChanged_Params_Data) == 16,
    "Bad sizeof(LocalFrameHost_HadStickyUserActivationBeforeNavigationChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_ScrollRectToVisibleInParentFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::RectF_Data> rect_to_scroll;
    mojo::internal::Pointer<::blink::mojom::internal::ScrollIntoViewParams_Data> params;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_ScrollRectToVisibleInParentFrame_Params_Data>;

    LocalFrameHost_ScrollRectToVisibleInParentFrame_Params_Data();
    ~LocalFrameHost_ScrollRectToVisibleInParentFrame_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_ScrollRectToVisibleInParentFrame_Params_Data) == 24, "Bad sizeof(LocalFrameHost_ScrollRectToVisibleInParentFrame_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_BubbleLogicalScrollInParentFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t direction;
    int32_t granularity;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_BubbleLogicalScrollInParentFrame_Params_Data>;

    LocalFrameHost_BubbleLogicalScrollInParentFrame_Params_Data();
    ~LocalFrameHost_BubbleLogicalScrollInParentFrame_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_BubbleLogicalScrollInParentFrame_Params_Data) == 16, "Bad sizeof(LocalFrameHost_BubbleLogicalScrollInParentFrame_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidBlockNavigation_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> blocked_url;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> initiator_url;
    int32_t reason;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidBlockNavigation_Params_Data>;

    LocalFrameHost_DidBlockNavigation_Params_Data();
    ~LocalFrameHost_DidBlockNavigation_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidBlockNavigation_Params_Data) == 32, "Bad sizeof(LocalFrameHost_DidBlockNavigation_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidChangeLoadProgress_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    double load_progress;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidChangeLoadProgress_Params_Data>;

    LocalFrameHost_DidChangeLoadProgress_Params_Data();
    ~LocalFrameHost_DidChangeLoadProgress_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidChangeLoadProgress_Params_Data) == 16, "Bad sizeof(LocalFrameHost_DidChangeLoadProgress_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidFinishLoad_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> validated_url;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidFinishLoad_Params_Data>;

    LocalFrameHost_DidFinishLoad_Params_Data();
    ~LocalFrameHost_DidFinishLoad_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidFinishLoad_Params_Data) == 16, "Bad sizeof(LocalFrameHost_DidFinishLoad_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DispatchLoad_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DispatchLoad_Params_Data>;

    LocalFrameHost_DispatchLoad_Params_Data();
    ~LocalFrameHost_DispatchLoad_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DispatchLoad_Params_Data) == 8, "Bad sizeof(LocalFrameHost_DispatchLoad_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_GoToEntryAtOffset_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t offset;
    uint8_t has_user_gesture : 1;
    uint8_t padfinal_[3];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_GoToEntryAtOffset_Params_Data>;

    LocalFrameHost_GoToEntryAtOffset_Params_Data();
    ~LocalFrameHost_GoToEntryAtOffset_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_GoToEntryAtOffset_Params_Data) == 16, "Bad sizeof(LocalFrameHost_GoToEntryAtOffset_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_NavigateToNavigationApiKey_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> key;
    uint8_t has_user_gesture : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_NavigateToNavigationApiKey_Params_Data>;

    LocalFrameHost_NavigateToNavigationApiKey_Params_Data();
    ~LocalFrameHost_NavigateToNavigationApiKey_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_NavigateToNavigationApiKey_Params_Data) == 24, "Bad sizeof(LocalFrameHost_NavigateToNavigationApiKey_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_UpdateTitle_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> title;
    int32_t title_direction;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_UpdateTitle_Params_Data>;

    LocalFrameHost_UpdateTitle_Params_Data();
    ~LocalFrameHost_UpdateTitle_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_UpdateTitle_Params_Data) == 24, "Bad sizeof(LocalFrameHost_UpdateTitle_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_UpdateUserActivationState_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t update_type;
    int32_t notification_type;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_UpdateUserActivationState_Params_Data>;

    LocalFrameHost_UpdateUserActivationState_Params_Data();
    ~LocalFrameHost_UpdateUserActivationState_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_UpdateUserActivationState_Params_Data) == 16, "Bad sizeof(LocalFrameHost_UpdateUserActivationState_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_HandleAccessibilityFindInPageResult_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::FindInPageResultAXParams_Data> params;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_HandleAccessibilityFindInPageResult_Params_Data>;

    LocalFrameHost_HandleAccessibilityFindInPageResult_Params_Data();
    ~LocalFrameHost_HandleAccessibilityFindInPageResult_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_HandleAccessibilityFindInPageResult_Params_Data) == 16, "Bad sizeof(LocalFrameHost_HandleAccessibilityFindInPageResult_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_HandleAccessibilityFindInPageTermination_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_HandleAccessibilityFindInPageTermination_Params_Data>;

    LocalFrameHost_HandleAccessibilityFindInPageTermination_Params_Data();
    ~LocalFrameHost_HandleAccessibilityFindInPageTermination_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_HandleAccessibilityFindInPageTermination_Params_Data) == 8, "Bad sizeof(LocalFrameHost_HandleAccessibilityFindInPageTermination_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DocumentOnLoadCompleted_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DocumentOnLoadCompleted_Params_Data>;

    LocalFrameHost_DocumentOnLoadCompleted_Params_Data();
    ~LocalFrameHost_DocumentOnLoadCompleted_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DocumentOnLoadCompleted_Params_Data) == 8, "Bad sizeof(LocalFrameHost_DocumentOnLoadCompleted_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_ForwardResourceTimingToParent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::ResourceTimingInfo_Data> timing;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_ForwardResourceTimingToParent_Params_Data>;

    LocalFrameHost_ForwardResourceTimingToParent_Params_Data();
    ~LocalFrameHost_ForwardResourceTimingToParent_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_ForwardResourceTimingToParent_Params_Data) == 16, "Bad sizeof(LocalFrameHost_ForwardResourceTimingToParent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidDispatchDOMContentLoadedEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidDispatchDOMContentLoadedEvent_Params_Data>;

    LocalFrameHost_DidDispatchDOMContentLoadedEvent_Params_Data();
    ~LocalFrameHost_DidDispatchDOMContentLoadedEvent_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidDispatchDOMContentLoadedEvent_Params_Data) == 8, "Bad sizeof(LocalFrameHost_DidDispatchDOMContentLoadedEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_RunModalAlertDialog_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> alert_message;
    uint8_t disable_third_party_subframe_suppresion : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_RunModalAlertDialog_Params_Data>;

    LocalFrameHost_RunModalAlertDialog_Params_Data();
    ~LocalFrameHost_RunModalAlertDialog_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_RunModalAlertDialog_Params_Data) == 24, "Bad sizeof(LocalFrameHost_RunModalAlertDialog_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_RunModalAlertDialog_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_RunModalAlertDialog_ResponseParams_Data>;

    LocalFrameHost_RunModalAlertDialog_ResponseParams_Data();
    ~LocalFrameHost_RunModalAlertDialog_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_RunModalAlertDialog_ResponseParams_Data) == 8, "Bad sizeof(LocalFrameHost_RunModalAlertDialog_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_RunModalConfirmDialog_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> alert_message;
    uint8_t disable_third_party_subframe_suppresion : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_RunModalConfirmDialog_Params_Data>;

    LocalFrameHost_RunModalConfirmDialog_Params_Data();
    ~LocalFrameHost_RunModalConfirmDialog_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_RunModalConfirmDialog_Params_Data) == 24, "Bad sizeof(LocalFrameHost_RunModalConfirmDialog_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_RunModalConfirmDialog_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_RunModalConfirmDialog_ResponseParams_Data>;

    LocalFrameHost_RunModalConfirmDialog_ResponseParams_Data();
    ~LocalFrameHost_RunModalConfirmDialog_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_RunModalConfirmDialog_ResponseParams_Data) == 16, "Bad sizeof(LocalFrameHost_RunModalConfirmDialog_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_RunModalPromptDialog_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> alert_message;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> default_value;
    uint8_t disable_third_party_subframe_suppresion : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_RunModalPromptDialog_Params_Data>;

    LocalFrameHost_RunModalPromptDialog_Params_Data();
    ~LocalFrameHost_RunModalPromptDialog_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_RunModalPromptDialog_Params_Data) == 32, "Bad sizeof(LocalFrameHost_RunModalPromptDialog_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_RunModalPromptDialog_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> result;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_RunModalPromptDialog_ResponseParams_Data>;

    LocalFrameHost_RunModalPromptDialog_ResponseParams_Data();
    ~LocalFrameHost_RunModalPromptDialog_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_RunModalPromptDialog_ResponseParams_Data) == 24, "Bad sizeof(LocalFrameHost_RunModalPromptDialog_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_RunBeforeUnloadConfirm_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t is_reload : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_RunBeforeUnloadConfirm_Params_Data>;

    LocalFrameHost_RunBeforeUnloadConfirm_Params_Data();
    ~LocalFrameHost_RunBeforeUnloadConfirm_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_RunBeforeUnloadConfirm_Params_Data) == 16, "Bad sizeof(LocalFrameHost_RunBeforeUnloadConfirm_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_RunBeforeUnloadConfirm_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_RunBeforeUnloadConfirm_ResponseParams_Data>;

    LocalFrameHost_RunBeforeUnloadConfirm_ResponseParams_Data();
    ~LocalFrameHost_RunBeforeUnloadConfirm_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_RunBeforeUnloadConfirm_ResponseParams_Data) == 16, "Bad sizeof(LocalFrameHost_RunBeforeUnloadConfirm_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_UpdateFaviconURL_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::blink::mojom::internal::FaviconURL_Data>>> favicon_urls;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_UpdateFaviconURL_Params_Data>;

    LocalFrameHost_UpdateFaviconURL_Params_Data();
    ~LocalFrameHost_UpdateFaviconURL_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_UpdateFaviconURL_Params_Data) == 16, "Bad sizeof(LocalFrameHost_UpdateFaviconURL_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DownloadURL_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::DownloadURLParams_Data> params;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DownloadURL_Params_Data>;

    LocalFrameHost_DownloadURL_Params_Data();
    ~LocalFrameHost_DownloadURL_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DownloadURL_Params_Data) == 16, "Bad sizeof(LocalFrameHost_DownloadURL_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_FocusedElementChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t is_editable_element : 1;
    uint8_t pad0_[3];
    int32_t focus_type;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> bounds_in_frame_widget;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_FocusedElementChanged_Params_Data>;

    LocalFrameHost_FocusedElementChanged_Params_Data();
    ~LocalFrameHost_FocusedElementChanged_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_FocusedElementChanged_Params_Data) == 24, "Bad sizeof(LocalFrameHost_FocusedElementChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_TextSelectionChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::BigString16_Data> text;
    uint32_t offset;
    uint8_t pad1_[4];
    mojo::internal::Pointer<::gfx::mojom::internal::Range_Data> range;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_TextSelectionChanged_Params_Data>;

    LocalFrameHost_TextSelectionChanged_Params_Data();
    ~LocalFrameHost_TextSelectionChanged_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_TextSelectionChanged_Params_Data) == 32, "Bad sizeof(LocalFrameHost_TextSelectionChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_ShowPopupMenu_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data popup_client;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> bounds;
    int32_t item_height;
    int32_t selected_item;
    double font_size;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::blink::mojom::internal::MenuItem_Data>>> menu_items;
    uint8_t right_aligned : 1;
    uint8_t allow_multiple_selection : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_ShowPopupMenu_Params_Data>;

    LocalFrameHost_ShowPopupMenu_Params_Data();
    ~LocalFrameHost_ShowPopupMenu_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_ShowPopupMenu_Params_Data) == 56, "Bad sizeof(LocalFrameHost_ShowPopupMenu_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_CreateNewPopupWidget_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedEndpointHandle_Data popup_host;
    mojo::internal::AssociatedEndpointHandle_Data blink_widget_host;
    mojo::internal::AssociatedInterface_Data blink_widget;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_CreateNewPopupWidget_Params_Data>;

    LocalFrameHost_CreateNewPopupWidget_Params_Data();
    ~LocalFrameHost_CreateNewPopupWidget_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_CreateNewPopupWidget_Params_Data) == 24, "Bad sizeof(LocalFrameHost_CreateNewPopupWidget_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_ShowContextMenu_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedInterface_Data client;
    mojo::internal::Pointer<::blink::mojom::internal::UntrustworthyContextMenuParams_Data> params;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_ShowContextMenu_Params_Data>;

    LocalFrameHost_ShowContextMenu_Params_Data();
    ~LocalFrameHost_ShowContextMenu_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_ShowContextMenu_Params_Data) == 24, "Bad sizeof(LocalFrameHost_ShowContextMenu_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidLoadResourceFromMemoryCache_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;
    mojo::internal::Pointer<mojo::internal::String_Data> http_method;
    mojo::internal::Pointer<mojo::internal::String_Data> mime_type;
    int32_t request_destination;
    uint8_t include_credentials : 1;
    uint8_t padfinal_[3];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidLoadResourceFromMemoryCache_Params_Data>;

    LocalFrameHost_DidLoadResourceFromMemoryCache_Params_Data();
    ~LocalFrameHost_DidLoadResourceFromMemoryCache_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidLoadResourceFromMemoryCache_Params_Data) == 40, "Bad sizeof(LocalFrameHost_DidLoadResourceFromMemoryCache_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidChangeFrameOwnerProperties_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::blink::mojom::internal::FrameToken_Data child_frame_token;
    mojo::internal::Pointer<::blink::mojom::internal::FrameOwnerProperties_Data> frame_owner_properties;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidChangeFrameOwnerProperties_Params_Data>;

    LocalFrameHost_DidChangeFrameOwnerProperties_Params_Data();
    ~LocalFrameHost_DidChangeFrameOwnerProperties_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidChangeFrameOwnerProperties_Params_Data) == 32, "Bad sizeof(LocalFrameHost_DidChangeFrameOwnerProperties_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidChangeOpener_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::LocalFrameToken_Data> opener_frame;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidChangeOpener_Params_Data>;

    LocalFrameHost_DidChangeOpener_Params_Data();
    ~LocalFrameHost_DidChangeOpener_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidChangeOpener_Params_Data) == 16, "Bad sizeof(LocalFrameHost_DidChangeOpener_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidChangeFramePolicy_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::blink::mojom::internal::FrameToken_Data child_frame_token;
    mojo::internal::Pointer<::blink::mojom::internal::FramePolicy_Data> frame_policy;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidChangeFramePolicy_Params_Data>;

    LocalFrameHost_DidChangeFramePolicy_Params_Data();
    ~LocalFrameHost_DidChangeFramePolicy_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidChangeFramePolicy_Params_Data) == 32, "Bad sizeof(LocalFrameHost_DidChangeFramePolicy_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidChangeIframeAttributes_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::blink::mojom::internal::FrameToken_Data child_frame_token;
    mojo::internal::Pointer<internal::IframeAttributes_Data> attributes;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidChangeIframeAttributes_Params_Data>;

    LocalFrameHost_DidChangeIframeAttributes_Params_Data();
    ~LocalFrameHost_DidChangeIframeAttributes_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidChangeIframeAttributes_Params_Data) == 32, "Bad sizeof(LocalFrameHost_DidChangeIframeAttributes_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_CapturePaintPreviewOfSubframe_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> clip_rect;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> guid;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_CapturePaintPreviewOfSubframe_Params_Data>;

    LocalFrameHost_CapturePaintPreviewOfSubframe_Params_Data();
    ~LocalFrameHost_CapturePaintPreviewOfSubframe_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_CapturePaintPreviewOfSubframe_Params_Data) == 24, "Bad sizeof(LocalFrameHost_CapturePaintPreviewOfSubframe_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_SetCloseListener_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data listener;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_SetCloseListener_Params_Data>;

    LocalFrameHost_SetCloseListener_Params_Data();
    ~LocalFrameHost_SetCloseListener_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_SetCloseListener_Params_Data) == 16, "Bad sizeof(LocalFrameHost_SetCloseListener_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_Detach_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_Detach_Params_Data>;

    LocalFrameHost_Detach_Params_Data();
    ~LocalFrameHost_Detach_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_Detach_Params_Data) == 8, "Bad sizeof(LocalFrameHost_Detach_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_GetKeepAliveHandleFactory_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data factory;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_GetKeepAliveHandleFactory_Params_Data>;

    LocalFrameHost_GetKeepAliveHandleFactory_Params_Data();
    ~LocalFrameHost_GetKeepAliveHandleFactory_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_GetKeepAliveHandleFactory_Params_Data) == 16, "Bad sizeof(LocalFrameHost_GetKeepAliveHandleFactory_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidAddMessageToConsole_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t log_level;
    uint32_t line_number;
    mojo::internal::Pointer<::mojo_base::mojom::internal::BigString16_Data> msg;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> source_id;
    mojo::internal::Pointer<::mojo_base::mojom::internal::BigString16_Data> untrusted_stack_trace;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidAddMessageToConsole_Params_Data>;

    LocalFrameHost_DidAddMessageToConsole_Params_Data();
    ~LocalFrameHost_DidAddMessageToConsole_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidAddMessageToConsole_Params_Data) == 40, "Bad sizeof(LocalFrameHost_DidAddMessageToConsole_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_FrameSizeChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Size_Data> size;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_FrameSizeChanged_Params_Data>;

    LocalFrameHost_FrameSizeChanged_Params_Data();
    ~LocalFrameHost_FrameSizeChanged_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_FrameSizeChanged_Params_Data) == 16, "Bad sizeof(LocalFrameHost_FrameSizeChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidInferColorScheme_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t color_scheme;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidInferColorScheme_Params_Data>;

    LocalFrameHost_DidInferColorScheme_Params_Data();
    ~LocalFrameHost_DidInferColorScheme_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidInferColorScheme_Params_Data) == 16, "Bad sizeof(LocalFrameHost_DidInferColorScheme_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidChangeSrcDoc_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::blink::mojom::internal::FrameToken_Data child_frame_token;
    mojo::internal::Pointer<mojo::internal::String_Data> srcdoc_value;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidChangeSrcDoc_Params_Data>;

    LocalFrameHost_DidChangeSrcDoc_Params_Data();
    ~LocalFrameHost_DidChangeSrcDoc_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidChangeSrcDoc_Params_Data) == 32, "Bad sizeof(LocalFrameHost_DidChangeSrcDoc_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_DidChangeBaseURL_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> base_url;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_DidChangeBaseURL_Params_Data>;

    LocalFrameHost_DidChangeBaseURL_Params_Data();
    ~LocalFrameHost_DidChangeBaseURL_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_DidChangeBaseURL_Params_Data) == 16, "Bad sizeof(LocalFrameHost_DidChangeBaseURL_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_ReceivedDelegatedCapability_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t delegated_capability;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_ReceivedDelegatedCapability_Params_Data>;

    LocalFrameHost_ReceivedDelegatedCapability_Params_Data();
    ~LocalFrameHost_ReceivedDelegatedCapability_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_ReceivedDelegatedCapability_Params_Data) == 16, "Bad sizeof(LocalFrameHost_ReceivedDelegatedCapability_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_CreatePortal_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedEndpointHandle_Data portal;
    mojo::internal::AssociatedInterface_Data client;
    uint8_t pad1_[4];
    mojo::internal::Pointer<::blink::mojom::internal::RemoteFrameInterfacesFromRenderer_Data> remote_frame_interfaces;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_CreatePortal_Params_Data>;

    LocalFrameHost_CreatePortal_Params_Data();
    ~LocalFrameHost_CreatePortal_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_CreatePortal_Params_Data) == 32, "Bad sizeof(LocalFrameHost_CreatePortal_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_CreatePortal_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FrameReplicationState_Data> initial_replicated_state;
    mojo::internal::Pointer<::blink::mojom::internal::PortalToken_Data> portal_token;
    mojo::internal::Pointer<::blink::mojom::internal::RemoteFrameToken_Data> frame_token;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> devtools_frame_token;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_CreatePortal_ResponseParams_Data>;

    LocalFrameHost_CreatePortal_ResponseParams_Data();
    ~LocalFrameHost_CreatePortal_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_CreatePortal_ResponseParams_Data) == 40, "Bad sizeof(LocalFrameHost_CreatePortal_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_AdoptPortal_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::PortalToken_Data> portal_token;
    mojo::internal::Pointer<::blink::mojom::internal::RemoteFrameInterfacesFromRenderer_Data> remote_frame_interfaces;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_AdoptPortal_Params_Data>;

    LocalFrameHost_AdoptPortal_Params_Data();
    ~LocalFrameHost_AdoptPortal_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_AdoptPortal_Params_Data) == 24, "Bad sizeof(LocalFrameHost_AdoptPortal_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_AdoptPortal_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FrameReplicationState_Data> replicated_state;
    mojo::internal::Pointer<::blink::mojom::internal::RemoteFrameToken_Data> frame_token;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> devtools_frame_token;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_AdoptPortal_ResponseParams_Data>;

    LocalFrameHost_AdoptPortal_ResponseParams_Data();
    ~LocalFrameHost_AdoptPortal_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_AdoptPortal_ResponseParams_Data) == 32, "Bad sizeof(LocalFrameHost_AdoptPortal_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrameHost_CreateFencedFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedEndpointHandle_Data fenced_frame;
    int32_t mode;
    mojo::internal::Pointer<::blink::mojom::internal::RemoteFrameInterfacesFromRenderer_Data> remote_frame_interfaces;
    mojo::internal::Pointer<::blink::mojom::internal::RemoteFrameToken_Data> frame_token;
    mojo::internal::Pointer<::mojo_base::mojom::internal::UnguessableToken_Data> devtools_frame_token;

private:
    friend class mojo::internal::MessageFragment<LocalFrameHost_CreateFencedFrame_Params_Data>;

    LocalFrameHost_CreateFencedFrame_Params_Data();
    ~LocalFrameHost_CreateFencedFrame_Params_Data() = delete;
};
static_assert(sizeof(LocalFrameHost_CreateFencedFrame_Params_Data) == 40, "Bad sizeof(LocalFrameHost_CreateFencedFrame_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_GetTextSurroundingSelection_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint32_t max_length;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_GetTextSurroundingSelection_Params_Data>;

    LocalFrame_GetTextSurroundingSelection_Params_Data();
    ~LocalFrame_GetTextSurroundingSelection_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_GetTextSurroundingSelection_Params_Data) == 16, "Bad sizeof(LocalFrame_GetTextSurroundingSelection_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_GetTextSurroundingSelection_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> content;
    uint32_t start_offset;
    uint32_t end_offset;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_GetTextSurroundingSelection_ResponseParams_Data>;

    LocalFrame_GetTextSurroundingSelection_ResponseParams_Data();
    ~LocalFrame_GetTextSurroundingSelection_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrame_GetTextSurroundingSelection_ResponseParams_Data) == 24, "Bad sizeof(LocalFrame_GetTextSurroundingSelection_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_SendInterventionReport_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> id;
    mojo::internal::Pointer<mojo::internal::String_Data> message;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_SendInterventionReport_Params_Data>;

    LocalFrame_SendInterventionReport_Params_Data();
    ~LocalFrame_SendInterventionReport_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_SendInterventionReport_Params_Data) == 24, "Bad sizeof(LocalFrame_SendInterventionReport_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_SetFrameOwnerProperties_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FrameOwnerProperties_Data> properties;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_SetFrameOwnerProperties_Params_Data>;

    LocalFrame_SetFrameOwnerProperties_Params_Data();
    ~LocalFrame_SetFrameOwnerProperties_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_SetFrameOwnerProperties_Params_Data) == 16, "Bad sizeof(LocalFrame_SetFrameOwnerProperties_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_NotifyUserActivation_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t notification_type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_NotifyUserActivation_Params_Data>;

    LocalFrame_NotifyUserActivation_Params_Data();
    ~LocalFrame_NotifyUserActivation_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_NotifyUserActivation_Params_Data) == 16, "Bad sizeof(LocalFrame_NotifyUserActivation_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_NotifyVirtualKeyboardOverlayRect_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> keyboard_rect;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_NotifyVirtualKeyboardOverlayRect_Params_Data>;

    LocalFrame_NotifyVirtualKeyboardOverlayRect_Params_Data();
    ~LocalFrame_NotifyVirtualKeyboardOverlayRect_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_NotifyVirtualKeyboardOverlayRect_Params_Data) == 16, "Bad sizeof(LocalFrame_NotifyVirtualKeyboardOverlayRect_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_AddMessageToConsole_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t level;
    uint8_t discard_duplicates : 1;
    uint8_t pad1_[3];
    mojo::internal::Pointer<mojo::internal::String_Data> message;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_AddMessageToConsole_Params_Data>;

    LocalFrame_AddMessageToConsole_Params_Data();
    ~LocalFrame_AddMessageToConsole_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_AddMessageToConsole_Params_Data) == 24, "Bad sizeof(LocalFrame_AddMessageToConsole_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_AddInspectorIssue_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::InspectorIssueInfo_Data> info;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_AddInspectorIssue_Params_Data>;

    LocalFrame_AddInspectorIssue_Params_Data();
    ~LocalFrame_AddInspectorIssue_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_AddInspectorIssue_Params_Data) == 16, "Bad sizeof(LocalFrame_AddInspectorIssue_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_SwapInImmediately_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_SwapInImmediately_Params_Data>;

    LocalFrame_SwapInImmediately_Params_Data();
    ~LocalFrame_SwapInImmediately_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_SwapInImmediately_Params_Data) == 8, "Bad sizeof(LocalFrame_SwapInImmediately_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_CheckCompleted_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_CheckCompleted_Params_Data>;

    LocalFrame_CheckCompleted_Params_Data();
    ~LocalFrame_CheckCompleted_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_CheckCompleted_Params_Data) == 8, "Bad sizeof(LocalFrame_CheckCompleted_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_StopLoading_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_StopLoading_Params_Data>;

    LocalFrame_StopLoading_Params_Data();
    ~LocalFrame_StopLoading_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_StopLoading_Params_Data) == 8, "Bad sizeof(LocalFrame_StopLoading_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_Collapse_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t collapsed : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_Collapse_Params_Data>;

    LocalFrame_Collapse_Params_Data();
    ~LocalFrame_Collapse_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_Collapse_Params_Data) == 16, "Bad sizeof(LocalFrame_Collapse_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_EnableViewSourceMode_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_EnableViewSourceMode_Params_Data>;

    LocalFrame_EnableViewSourceMode_Params_Data();
    ~LocalFrame_EnableViewSourceMode_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_EnableViewSourceMode_Params_Data) == 8, "Bad sizeof(LocalFrame_EnableViewSourceMode_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_Focus_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_Focus_Params_Data>;

    LocalFrame_Focus_Params_Data();
    ~LocalFrame_Focus_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_Focus_Params_Data) == 8, "Bad sizeof(LocalFrame_Focus_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_ClearFocusedElement_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_ClearFocusedElement_Params_Data>;

    LocalFrame_ClearFocusedElement_Params_Data();
    ~LocalFrame_ClearFocusedElement_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_ClearFocusedElement_Params_Data) == 8, "Bad sizeof(LocalFrame_ClearFocusedElement_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_GetResourceSnapshotForWebBundle_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_GetResourceSnapshotForWebBundle_Params_Data>;

    LocalFrame_GetResourceSnapshotForWebBundle_Params_Data();
    ~LocalFrame_GetResourceSnapshotForWebBundle_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_GetResourceSnapshotForWebBundle_Params_Data) == 16, "Bad sizeof(LocalFrame_GetResourceSnapshotForWebBundle_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_CopyImageAt_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Point_Data> window_point;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_CopyImageAt_Params_Data>;

    LocalFrame_CopyImageAt_Params_Data();
    ~LocalFrame_CopyImageAt_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_CopyImageAt_Params_Data) == 16, "Bad sizeof(LocalFrame_CopyImageAt_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_SaveImageAt_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Point_Data> window_point;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_SaveImageAt_Params_Data>;

    LocalFrame_SaveImageAt_Params_Data();
    ~LocalFrame_SaveImageAt_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_SaveImageAt_Params_Data) == 16, "Bad sizeof(LocalFrame_SaveImageAt_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_ReportBlinkFeatureUsage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<int32_t>> features;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_ReportBlinkFeatureUsage_Params_Data>;

    LocalFrame_ReportBlinkFeatureUsage_Params_Data();
    ~LocalFrame_ReportBlinkFeatureUsage_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_ReportBlinkFeatureUsage_Params_Data) == 16, "Bad sizeof(LocalFrame_ReportBlinkFeatureUsage_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_RenderFallbackContent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_RenderFallbackContent_Params_Data>;

    LocalFrame_RenderFallbackContent_Params_Data();
    ~LocalFrame_RenderFallbackContent_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_RenderFallbackContent_Params_Data) == 8, "Bad sizeof(LocalFrame_RenderFallbackContent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_RenderFallbackContentWithResourceTiming_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::ResourceTimingInfo_Data> timing;
    mojo::internal::Pointer<mojo::internal::String_Data> server_timing_value;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_RenderFallbackContentWithResourceTiming_Params_Data>;

    LocalFrame_RenderFallbackContentWithResourceTiming_Params_Data();
    ~LocalFrame_RenderFallbackContentWithResourceTiming_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_RenderFallbackContentWithResourceTiming_Params_Data) == 24, "Bad sizeof(LocalFrame_RenderFallbackContentWithResourceTiming_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_BeforeUnload_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t is_reload : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_BeforeUnload_Params_Data>;

    LocalFrame_BeforeUnload_Params_Data();
    ~LocalFrame_BeforeUnload_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_BeforeUnload_Params_Data) == 16, "Bad sizeof(LocalFrame_BeforeUnload_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_BeforeUnload_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t proceed : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeTicks_Data> before_unload_start_time;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeTicks_Data> before_unload_end_time;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_BeforeUnload_ResponseParams_Data>;

    LocalFrame_BeforeUnload_ResponseParams_Data();
    ~LocalFrame_BeforeUnload_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrame_BeforeUnload_ResponseParams_Data) == 32, "Bad sizeof(LocalFrame_BeforeUnload_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_MediaPlayerActionAt_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Point_Data> location;
    mojo::internal::Pointer<::blink::mojom::internal::MediaPlayerAction_Data> action;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_MediaPlayerActionAt_Params_Data>;

    LocalFrame_MediaPlayerActionAt_Params_Data();
    ~LocalFrame_MediaPlayerActionAt_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_MediaPlayerActionAt_Params_Data) == 24, "Bad sizeof(LocalFrame_MediaPlayerActionAt_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_PluginActionAt_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Point_Data> location;
    int32_t action;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_PluginActionAt_Params_Data>;

    LocalFrame_PluginActionAt_Params_Data();
    ~LocalFrame_PluginActionAt_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_PluginActionAt_Params_Data) == 24, "Bad sizeof(LocalFrame_PluginActionAt_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_AdvanceFocusInFrame_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t focus_type;
    uint8_t pad0_[4];
    mojo::internal::Pointer<::blink::mojom::internal::RemoteFrameToken_Data> source_frame_token;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_AdvanceFocusInFrame_Params_Data>;

    LocalFrame_AdvanceFocusInFrame_Params_Data();
    ~LocalFrame_AdvanceFocusInFrame_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_AdvanceFocusInFrame_Params_Data) == 24, "Bad sizeof(LocalFrame_AdvanceFocusInFrame_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_AdvanceFocusForIME_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t focus_type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_AdvanceFocusForIME_Params_Data>;

    LocalFrame_AdvanceFocusForIME_Params_Data();
    ~LocalFrame_AdvanceFocusForIME_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_AdvanceFocusForIME_Params_Data) == 16, "Bad sizeof(LocalFrame_AdvanceFocusForIME_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_ReportContentSecurityPolicyViolation_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::network::mojom::internal::CSPViolation_Data> violation;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_ReportContentSecurityPolicyViolation_Params_Data>;

    LocalFrame_ReportContentSecurityPolicyViolation_Params_Data();
    ~LocalFrame_ReportContentSecurityPolicyViolation_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_ReportContentSecurityPolicyViolation_Params_Data) == 16, "Bad sizeof(LocalFrame_ReportContentSecurityPolicyViolation_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_DidUpdateFramePolicy_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::FramePolicy_Data> frame_policy;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_DidUpdateFramePolicy_Params_Data>;

    LocalFrame_DidUpdateFramePolicy_Params_Data();
    ~LocalFrame_DidUpdateFramePolicy_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_DidUpdateFramePolicy_Params_Data) == 16, "Bad sizeof(LocalFrame_DidUpdateFramePolicy_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_PostMessageEvent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::RemoteFrameToken_Data> source_frame_token;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> source_origin;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> target_origin;
    mojo::internal::Pointer<::blink::mojom::internal::TransferableMessage_Data> message;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_PostMessageEvent_Params_Data>;

    LocalFrame_PostMessageEvent_Params_Data();
    ~LocalFrame_PostMessageEvent_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_PostMessageEvent_Params_Data) == 40, "Bad sizeof(LocalFrame_PostMessageEvent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_JavaScriptMethodExecuteRequest_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> object_name;
    mojo::internal::Pointer<::mojo_base::mojom::internal::String16_Data> method_name;
    mojo::internal::Pointer<::mojo_base::mojom::internal::ListValue_Data> arguments;
    uint8_t wants_result : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_JavaScriptMethodExecuteRequest_Params_Data>;

    LocalFrame_JavaScriptMethodExecuteRequest_Params_Data();
    ~LocalFrame_JavaScriptMethodExecuteRequest_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_JavaScriptMethodExecuteRequest_Params_Data) == 40, "Bad sizeof(LocalFrame_JavaScriptMethodExecuteRequest_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_JavaScriptMethodExecuteRequest_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::mojo_base::mojom::internal::Value_Data result;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_JavaScriptMethodExecuteRequest_ResponseParams_Data>;

    LocalFrame_JavaScriptMethodExecuteRequest_ResponseParams_Data();
    ~LocalFrame_JavaScriptMethodExecuteRequest_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrame_JavaScriptMethodExecuteRequest_ResponseParams_Data) == 24, "Bad sizeof(LocalFrame_JavaScriptMethodExecuteRequest_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_JavaScriptExecuteRequest_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::BigString16_Data> javascript;
    uint8_t wants_result : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_JavaScriptExecuteRequest_Params_Data>;

    LocalFrame_JavaScriptExecuteRequest_Params_Data();
    ~LocalFrame_JavaScriptExecuteRequest_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_JavaScriptExecuteRequest_Params_Data) == 24, "Bad sizeof(LocalFrame_JavaScriptExecuteRequest_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_JavaScriptExecuteRequest_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::mojo_base::mojom::internal::Value_Data result;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_JavaScriptExecuteRequest_ResponseParams_Data>;

    LocalFrame_JavaScriptExecuteRequest_ResponseParams_Data();
    ~LocalFrame_JavaScriptExecuteRequest_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrame_JavaScriptExecuteRequest_ResponseParams_Data) == 24, "Bad sizeof(LocalFrame_JavaScriptExecuteRequest_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_JavaScriptExecuteRequestForTests_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::BigString16_Data> javascript;
    uint8_t has_user_gesture : 1;
    uint8_t resolve_promises : 1;
    uint8_t pad2_[3];
    int32_t world_id;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_JavaScriptExecuteRequestForTests_Params_Data>;

    LocalFrame_JavaScriptExecuteRequestForTests_Params_Data();
    ~LocalFrame_JavaScriptExecuteRequestForTests_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_JavaScriptExecuteRequestForTests_Params_Data) == 24, "Bad sizeof(LocalFrame_JavaScriptExecuteRequestForTests_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_JavaScriptExecuteRequestForTests_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result_type;
    uint8_t pad0_[4];
    ::mojo_base::mojom::internal::Value_Data result;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_JavaScriptExecuteRequestForTests_ResponseParams_Data>;

    LocalFrame_JavaScriptExecuteRequestForTests_ResponseParams_Data();
    ~LocalFrame_JavaScriptExecuteRequestForTests_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrame_JavaScriptExecuteRequestForTests_ResponseParams_Data) == 32, "Bad sizeof(LocalFrame_JavaScriptExecuteRequestForTests_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_JavaScriptExecuteRequestInIsolatedWorld_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::mojo_base::mojom::internal::BigString16_Data> javascript;
    uint8_t wants_result : 1;
    uint8_t pad1_[3];
    int32_t world_id;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_JavaScriptExecuteRequestInIsolatedWorld_Params_Data>;

    LocalFrame_JavaScriptExecuteRequestInIsolatedWorld_Params_Data();
    ~LocalFrame_JavaScriptExecuteRequestInIsolatedWorld_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_JavaScriptExecuteRequestInIsolatedWorld_Params_Data) == 24, "Bad sizeof(LocalFrame_JavaScriptExecuteRequestInIsolatedWorld_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_JavaScriptExecuteRequestInIsolatedWorld_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::mojo_base::mojom::internal::Value_Data result;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_JavaScriptExecuteRequestInIsolatedWorld_ResponseParams_Data>;

    LocalFrame_JavaScriptExecuteRequestInIsolatedWorld_ResponseParams_Data();
    ~LocalFrame_JavaScriptExecuteRequestInIsolatedWorld_ResponseParams_Data() = delete;
};
static_assert(
    sizeof(LocalFrame_JavaScriptExecuteRequestInIsolatedWorld_ResponseParams_Data) == 24, "Bad sizeof(LocalFrame_JavaScriptExecuteRequestInIsolatedWorld_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_BindReportingObserver_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_BindReportingObserver_Params_Data>;

    LocalFrame_BindReportingObserver_Params_Data();
    ~LocalFrame_BindReportingObserver_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_BindReportingObserver_Params_Data) == 16, "Bad sizeof(LocalFrame_BindReportingObserver_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_UpdateOpener_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::blink::mojom::internal::FrameToken_Data opener_frame_token;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_UpdateOpener_Params_Data>;

    LocalFrame_UpdateOpener_Params_Data();
    ~LocalFrame_UpdateOpener_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_UpdateOpener_Params_Data) == 24, "Bad sizeof(LocalFrame_UpdateOpener_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_GetSavableResourceLinks_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_GetSavableResourceLinks_Params_Data>;

    LocalFrame_GetSavableResourceLinks_Params_Data();
    ~LocalFrame_GetSavableResourceLinks_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_GetSavableResourceLinks_Params_Data) == 8, "Bad sizeof(LocalFrame_GetSavableResourceLinks_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_GetSavableResourceLinks_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<internal::GetSavableResourceLinksReply_Data> reply;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_GetSavableResourceLinks_ResponseParams_Data>;

    LocalFrame_GetSavableResourceLinks_ResponseParams_Data();
    ~LocalFrame_GetSavableResourceLinks_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrame_GetSavableResourceLinks_ResponseParams_Data) == 16, "Bad sizeof(LocalFrame_GetSavableResourceLinks_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_MixedContentFound_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> main_resource_url;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> mixed_content_url;
    int32_t request_context;
    uint8_t was_allowed : 1;
    uint8_t had_redirect : 1;
    uint8_t pad4_[3];
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url_before_redirects;
    mojo::internal::Pointer<::network::mojom::internal::SourceLocation_Data> source_location;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_MixedContentFound_Params_Data>;

    LocalFrame_MixedContentFound_Params_Data();
    ~LocalFrame_MixedContentFound_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_MixedContentFound_Params_Data) == 48, "Bad sizeof(LocalFrame_MixedContentFound_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_BindDevToolsAgent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::AssociatedInterface_Data agent_host;
    mojo::internal::AssociatedEndpointHandle_Data agent;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_BindDevToolsAgent_Params_Data>;

    LocalFrame_BindDevToolsAgent_Params_Data();
    ~LocalFrame_BindDevToolsAgent_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_BindDevToolsAgent_Params_Data) == 24, "Bad sizeof(LocalFrame_BindDevToolsAgent_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_HandleRendererDebugURL_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_HandleRendererDebugURL_Params_Data>;

    LocalFrame_HandleRendererDebugURL_Params_Data();
    ~LocalFrame_HandleRendererDebugURL_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_HandleRendererDebugURL_Params_Data) == 16, "Bad sizeof(LocalFrame_HandleRendererDebugURL_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_GetCanonicalUrlForSharing_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_GetCanonicalUrlForSharing_Params_Data>;

    LocalFrame_GetCanonicalUrlForSharing_Params_Data();
    ~LocalFrame_GetCanonicalUrlForSharing_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_GetCanonicalUrlForSharing_Params_Data) == 8, "Bad sizeof(LocalFrame_GetCanonicalUrlForSharing_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_GetCanonicalUrlForSharing_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> canonical_url;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_GetCanonicalUrlForSharing_ResponseParams_Data>;

    LocalFrame_GetCanonicalUrlForSharing_ResponseParams_Data();
    ~LocalFrame_GetCanonicalUrlForSharing_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrame_GetCanonicalUrlForSharing_ResponseParams_Data) == 16, "Bad sizeof(LocalFrame_GetCanonicalUrlForSharing_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_GetOpenGraphMetadata_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_GetOpenGraphMetadata_Params_Data>;

    LocalFrame_GetOpenGraphMetadata_Params_Data();
    ~LocalFrame_GetOpenGraphMetadata_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_GetOpenGraphMetadata_Params_Data) == 8, "Bad sizeof(LocalFrame_GetOpenGraphMetadata_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_GetOpenGraphMetadata_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::OpenGraphMetadata_Data> metadata;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_GetOpenGraphMetadata_ResponseParams_Data>;

    LocalFrame_GetOpenGraphMetadata_ResponseParams_Data();
    ~LocalFrame_GetOpenGraphMetadata_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalFrame_GetOpenGraphMetadata_ResponseParams_Data) == 16, "Bad sizeof(LocalFrame_GetOpenGraphMetadata_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_SetNavigationApiHistoryEntriesForRestore_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::NavigationApiHistoryEntryArrays_Data> entry_arrays;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_SetNavigationApiHistoryEntriesForRestore_Params_Data>;

    LocalFrame_SetNavigationApiHistoryEntriesForRestore_Params_Data();
    ~LocalFrame_SetNavigationApiHistoryEntriesForRestore_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_SetNavigationApiHistoryEntriesForRestore_Params_Data) == 16, "Bad sizeof(LocalFrame_SetNavigationApiHistoryEntriesForRestore_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_NotifyNavigationApiOfDisposedEntries_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<mojo::internal::String_Data>>> keys;

private:
    friend class mojo::internal::MessageFragment<LocalFrame_NotifyNavigationApiOfDisposedEntries_Params_Data>;

    LocalFrame_NotifyNavigationApiOfDisposedEntries_Params_Data();
    ~LocalFrame_NotifyNavigationApiOfDisposedEntries_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_NotifyNavigationApiOfDisposedEntries_Params_Data) == 16, "Bad sizeof(LocalFrame_NotifyNavigationApiOfDisposedEntries_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalFrame_TraverseCancelled_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> navigation_api_key;
    int32_t reason;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalFrame_TraverseCancelled_Params_Data>;

    LocalFrame_TraverseCancelled_Params_Data();
    ~LocalFrame_TraverseCancelled_Params_Data() = delete;
};
static_assert(sizeof(LocalFrame_TraverseCancelled_Params_Data) == 24, "Bad sizeof(LocalFrame_TraverseCancelled_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) HighPriorityLocalFrame_DispatchBeforeUnload_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t is_reload : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<HighPriorityLocalFrame_DispatchBeforeUnload_Params_Data>;

    HighPriorityLocalFrame_DispatchBeforeUnload_Params_Data();
    ~HighPriorityLocalFrame_DispatchBeforeUnload_Params_Data() = delete;
};
static_assert(sizeof(HighPriorityLocalFrame_DispatchBeforeUnload_Params_Data) == 16, "Bad sizeof(HighPriorityLocalFrame_DispatchBeforeUnload_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) HighPriorityLocalFrame_DispatchBeforeUnload_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t proceed : 1;
    uint8_t pad0_[7];
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeTicks_Data> before_unload_start_time;
    mojo::internal::Pointer<::mojo_base::mojom::internal::TimeTicks_Data> before_unload_end_time;

private:
    friend class mojo::internal::MessageFragment<HighPriorityLocalFrame_DispatchBeforeUnload_ResponseParams_Data>;

    HighPriorityLocalFrame_DispatchBeforeUnload_ResponseParams_Data();
    ~HighPriorityLocalFrame_DispatchBeforeUnload_ResponseParams_Data() = delete;
};
static_assert(sizeof(HighPriorityLocalFrame_DispatchBeforeUnload_ResponseParams_Data) == 32, "Bad sizeof(HighPriorityLocalFrame_DispatchBeforeUnload_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_AnimateDoubleTapZoom_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Point_Data> point;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> rect;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_AnimateDoubleTapZoom_Params_Data>;

    LocalMainFrame_AnimateDoubleTapZoom_Params_Data();
    ~LocalMainFrame_AnimateDoubleTapZoom_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_AnimateDoubleTapZoom_Params_Data) == 24, "Bad sizeof(LocalMainFrame_AnimateDoubleTapZoom_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_SetScaleFactor_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    float scale;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_SetScaleFactor_Params_Data>;

    LocalMainFrame_SetScaleFactor_Params_Data();
    ~LocalMainFrame_SetScaleFactor_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_SetScaleFactor_Params_Data) == 16, "Bad sizeof(LocalMainFrame_SetScaleFactor_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_ClosePage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_ClosePage_Params_Data>;

    LocalMainFrame_ClosePage_Params_Data();
    ~LocalMainFrame_ClosePage_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_ClosePage_Params_Data) == 8, "Bad sizeof(LocalMainFrame_ClosePage_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_ClosePage_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_ClosePage_ResponseParams_Data>;

    LocalMainFrame_ClosePage_ResponseParams_Data();
    ~LocalMainFrame_ClosePage_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_ClosePage_ResponseParams_Data) == 8, "Bad sizeof(LocalMainFrame_ClosePage_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_GetFullPageSize_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_GetFullPageSize_Params_Data>;

    LocalMainFrame_GetFullPageSize_Params_Data();
    ~LocalMainFrame_GetFullPageSize_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_GetFullPageSize_Params_Data) == 8, "Bad sizeof(LocalMainFrame_GetFullPageSize_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_GetFullPageSize_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Size_Data> full_page_size;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_GetFullPageSize_ResponseParams_Data>;

    LocalMainFrame_GetFullPageSize_ResponseParams_Data();
    ~LocalMainFrame_GetFullPageSize_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_GetFullPageSize_ResponseParams_Data) == 16, "Bad sizeof(LocalMainFrame_GetFullPageSize_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_SetInitialFocus_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t reverse : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_SetInitialFocus_Params_Data>;

    LocalMainFrame_SetInitialFocus_Params_Data();
    ~LocalMainFrame_SetInitialFocus_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_SetInitialFocus_Params_Data) == 16, "Bad sizeof(LocalMainFrame_SetInitialFocus_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_EnablePreferredSizeChangedMode_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_EnablePreferredSizeChangedMode_Params_Data>;

    LocalMainFrame_EnablePreferredSizeChangedMode_Params_Data();
    ~LocalMainFrame_EnablePreferredSizeChangedMode_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_EnablePreferredSizeChangedMode_Params_Data) == 8, "Bad sizeof(LocalMainFrame_EnablePreferredSizeChangedMode_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_ZoomToFindInPageRect_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> rect_in_root_frame;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_ZoomToFindInPageRect_Params_Data>;

    LocalMainFrame_ZoomToFindInPageRect_Params_Data();
    ~LocalMainFrame_ZoomToFindInPageRect_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_ZoomToFindInPageRect_Params_Data) == 16, "Bad sizeof(LocalMainFrame_ZoomToFindInPageRect_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_InstallCoopAccessMonitor_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    ::blink::mojom::internal::FrameToken_Data accessed_window;
    mojo::internal::Pointer<::network::mojom::internal::CrossOriginOpenerPolicyReporterParams_Data> coop_reporter_info;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_InstallCoopAccessMonitor_Params_Data>;

    LocalMainFrame_InstallCoopAccessMonitor_Params_Data();
    ~LocalMainFrame_InstallCoopAccessMonitor_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_InstallCoopAccessMonitor_Params_Data) == 32, "Bad sizeof(LocalMainFrame_InstallCoopAccessMonitor_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_OnPortalActivated_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::PortalToken_Data> portal_token;
    mojo::internal::AssociatedInterface_Data portal;
    mojo::internal::AssociatedEndpointHandle_Data portal_client;
    uint8_t pad2_[4];
    mojo::internal::Pointer<::blink::mojom::internal::TransferableMessage_Data> data;
    uint64_t trace_id;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_OnPortalActivated_Params_Data>;

    LocalMainFrame_OnPortalActivated_Params_Data();
    ~LocalMainFrame_OnPortalActivated_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_OnPortalActivated_Params_Data) == 48, "Bad sizeof(LocalMainFrame_OnPortalActivated_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_OnPortalActivated_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t result;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_OnPortalActivated_ResponseParams_Data>;

    LocalMainFrame_OnPortalActivated_ResponseParams_Data();
    ~LocalMainFrame_OnPortalActivated_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_OnPortalActivated_ResponseParams_Data) == 16, "Bad sizeof(LocalMainFrame_OnPortalActivated_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_ForwardMessageFromHost_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::TransferableMessage_Data> message;
    mojo::internal::Pointer<::url::mojom::internal::Origin_Data> source_origin;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_ForwardMessageFromHost_Params_Data>;

    LocalMainFrame_ForwardMessageFromHost_Params_Data();
    ~LocalMainFrame_ForwardMessageFromHost_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_ForwardMessageFromHost_Params_Data) == 24, "Bad sizeof(LocalMainFrame_ForwardMessageFromHost_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrame_UpdateBrowserControlsState_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t constraints;
    int32_t current;
    uint8_t animate : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalMainFrame_UpdateBrowserControlsState_Params_Data>;

    LocalMainFrame_UpdateBrowserControlsState_Params_Data();
    ~LocalMainFrame_UpdateBrowserControlsState_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrame_UpdateBrowserControlsState_Params_Data) == 24, "Bad sizeof(LocalMainFrame_UpdateBrowserControlsState_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_ScaleFactorChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    float scale;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_ScaleFactorChanged_Params_Data>;

    LocalMainFrameHost_ScaleFactorChanged_Params_Data();
    ~LocalMainFrameHost_ScaleFactorChanged_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_ScaleFactorChanged_Params_Data) == 16, "Bad sizeof(LocalMainFrameHost_ScaleFactorChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_ContentsPreferredSizeChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Size_Data> pref_size;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_ContentsPreferredSizeChanged_Params_Data>;

    LocalMainFrameHost_ContentsPreferredSizeChanged_Params_Data();
    ~LocalMainFrameHost_ContentsPreferredSizeChanged_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_ContentsPreferredSizeChanged_Params_Data) == 16, "Bad sizeof(LocalMainFrameHost_ContentsPreferredSizeChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_TextAutosizerPageInfoChanged_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::TextAutosizerPageInfo_Data> page_info;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_TextAutosizerPageInfoChanged_Params_Data>;

    LocalMainFrameHost_TextAutosizerPageInfoChanged_Params_Data();
    ~LocalMainFrameHost_TextAutosizerPageInfoChanged_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_TextAutosizerPageInfoChanged_Params_Data) == 16, "Bad sizeof(LocalMainFrameHost_TextAutosizerPageInfoChanged_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_FocusPage_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_FocusPage_Params_Data>;

    LocalMainFrameHost_FocusPage_Params_Data();
    ~LocalMainFrameHost_FocusPage_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_FocusPage_Params_Data) == 8, "Bad sizeof(LocalMainFrameHost_FocusPage_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_TakeFocus_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t reverse : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_TakeFocus_Params_Data>;

    LocalMainFrameHost_TakeFocus_Params_Data();
    ~LocalMainFrameHost_TakeFocus_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_TakeFocus_Params_Data) == 16, "Bad sizeof(LocalMainFrameHost_TakeFocus_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_UpdateTargetURL_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::url::mojom::internal::Url_Data> url;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_UpdateTargetURL_Params_Data>;

    LocalMainFrameHost_UpdateTargetURL_Params_Data();
    ~LocalMainFrameHost_UpdateTargetURL_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_UpdateTargetURL_Params_Data) == 16, "Bad sizeof(LocalMainFrameHost_UpdateTargetURL_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_UpdateTargetURL_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_UpdateTargetURL_ResponseParams_Data>;

    LocalMainFrameHost_UpdateTargetURL_ResponseParams_Data();
    ~LocalMainFrameHost_UpdateTargetURL_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_UpdateTargetURL_ResponseParams_Data) == 8, "Bad sizeof(LocalMainFrameHost_UpdateTargetURL_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_RequestClose_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_RequestClose_Params_Data>;

    LocalMainFrameHost_RequestClose_Params_Data();
    ~LocalMainFrameHost_RequestClose_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_RequestClose_Params_Data) == 8, "Bad sizeof(LocalMainFrameHost_RequestClose_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_ShowCreatedWindow_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::blink::mojom::internal::LocalFrameToken_Data> opener_frame_token;
    int32_t disposition;
    uint8_t opened_by_user_gesture : 1;
    uint8_t pad2_[3];
    mojo::internal::Pointer<::blink::mojom::internal::WindowFeatures_Data> window_features;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_ShowCreatedWindow_Params_Data>;

    LocalMainFrameHost_ShowCreatedWindow_Params_Data();
    ~LocalMainFrameHost_ShowCreatedWindow_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_ShowCreatedWindow_Params_Data) == 32, "Bad sizeof(LocalMainFrameHost_ShowCreatedWindow_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_ShowCreatedWindow_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_ShowCreatedWindow_ResponseParams_Data>;

    LocalMainFrameHost_ShowCreatedWindow_ResponseParams_Data();
    ~LocalMainFrameHost_ShowCreatedWindow_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_ShowCreatedWindow_ResponseParams_Data) == 8, "Bad sizeof(LocalMainFrameHost_ShowCreatedWindow_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_SetWindowRect_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::gfx::mojom::internal::Rect_Data> bounds;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_SetWindowRect_Params_Data>;

    LocalMainFrameHost_SetWindowRect_Params_Data();
    ~LocalMainFrameHost_SetWindowRect_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_SetWindowRect_Params_Data) == 16, "Bad sizeof(LocalMainFrameHost_SetWindowRect_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_SetWindowRect_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_SetWindowRect_ResponseParams_Data>;

    LocalMainFrameHost_SetWindowRect_ResponseParams_Data();
    ~LocalMainFrameHost_SetWindowRect_ResponseParams_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_SetWindowRect_ResponseParams_Data) == 8, "Bad sizeof(LocalMainFrameHost_SetWindowRect_ResponseParams_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_DidFirstVisuallyNonEmptyPaint_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_DidFirstVisuallyNonEmptyPaint_Params_Data>;

    LocalMainFrameHost_DidFirstVisuallyNonEmptyPaint_Params_Data();
    ~LocalMainFrameHost_DidFirstVisuallyNonEmptyPaint_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_DidFirstVisuallyNonEmptyPaint_Params_Data) == 8, "Bad sizeof(LocalMainFrameHost_DidFirstVisuallyNonEmptyPaint_Params_Data)");
class COMPONENT_EXPORT(MOJOM_SHARED_BLINK_COMMON_EXPORT) LocalMainFrameHost_DidAccessInitialMainDocument_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;

private:
    friend class mojo::internal::MessageFragment<LocalMainFrameHost_DidAccessInitialMainDocument_Params_Data>;

    LocalMainFrameHost_DidAccessInitialMainDocument_Params_Data();
    ~LocalMainFrameHost_DidAccessInitialMainDocument_Params_Data() = delete;
};
static_assert(sizeof(LocalMainFrameHost_DidAccessInitialMainDocument_Params_Data) == 8, "Bad sizeof(LocalMainFrameHost_DidAccessInitialMainDocument_Params_Data)");

} // namespace internal
class KeepAliveHandleFactory_IssueKeepAliveHandle_ParamsDataView {
public:
    KeepAliveHandleFactory_IssueKeepAliveHandle_ParamsDataView() = default;

    KeepAliveHandleFactory_IssueKeepAliveHandle_ParamsDataView(internal::KeepAliveHandleFactory_IssueKeepAliveHandle_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const { return !data_; }
    template <typename UserType> UserType TakeKeepAliveHandle()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfaceRequestDataView<::blink::mojom::KeepAliveHandleInterfaceBase>>(&data_->keep_alive_handle, &result, message_);
        DCHECK(ret);
        return result;
    }

private:
