// components/services/app_service/public/mojom/app_service.mojom-params-data.h is auto generated by mojom_bindings_generator.py, do not edit

// Copyright 2019 The Chromium Authors
// Use of this source code is governed by a BSD-style license that can be
// found in the LICENSE file.

#ifndef COMPONENTS_SERVICES_APP_SERVICE_PUBLIC_MOJOM_APP_SERVICE_MOJOM_PARAMS_DATA_H_
#define COMPONENTS_SERVICES_APP_SERVICE_PUBLIC_MOJOM_APP_SERVICE_MOJOM_PARAMS_DATA_H_

#include "mojo/public/cpp/bindings/lib/bindings_internal.h"
#include "mojo/public/cpp/bindings/lib/buffer.h"

#if defined(__clang__)
#pragma clang diagnostic push
#pragma clang diagnostic ignored "-Wunused-private-field"
#endif

namespace mojo::internal {
class ValidationContext;
}
namespace apps {
namespace mojom {
namespace internal {
class AppService_RegisterPublisher_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data publisher;
    int32_t app_type;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<AppService_RegisterPublisher_Params_Data>;

    AppService_RegisterPublisher_Params_Data();
    ~AppService_RegisterPublisher_Params_Data() = delete;
};
static_assert(sizeof(AppService_RegisterPublisher_Params_Data) == 24, "Bad sizeof(AppService_RegisterPublisher_Params_Data)");
class AppService_RegisterSubscriber_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data subscriber;
    mojo::internal::Pointer<internal::ConnectOptions_Data> opts;

private:
    friend class mojo::internal::MessageFragment<AppService_RegisterSubscriber_Params_Data>;

    AppService_RegisterSubscriber_Params_Data();
    ~AppService_RegisterSubscriber_Params_Data() = delete;
};
static_assert(sizeof(AppService_RegisterSubscriber_Params_Data) == 24, "Bad sizeof(AppService_RegisterSubscriber_Params_Data)");
class AppService_Launch_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t app_type;
    int32_t event_flags;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;
    int32_t launch_source;
    uint8_t pad3_[4];
    mojo::internal::Pointer<::apps::mojom::internal::WindowInfo_Data> window_info;

private:
    friend class mojo::internal::MessageFragment<AppService_Launch_Params_Data>;

    AppService_Launch_Params_Data();
    ~AppService_Launch_Params_Data() = delete;
};
static_assert(sizeof(AppService_Launch_Params_Data) == 40, "Bad sizeof(AppService_Launch_Params_Data)");
class AppService_LaunchAppWithFiles_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t app_type;
    int32_t event_flags;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;
    int32_t launch_source;
    uint8_t pad3_[4];
    mojo::internal::Pointer<::apps::mojom::internal::FilePaths_Data> file_paths;

private:
    friend class mojo::internal::MessageFragment<AppService_LaunchAppWithFiles_Params_Data>;

    AppService_LaunchAppWithFiles_Params_Data();
    ~AppService_LaunchAppWithFiles_Params_Data() = delete;
};
static_assert(sizeof(AppService_LaunchAppWithFiles_Params_Data) == 40, "Bad sizeof(AppService_LaunchAppWithFiles_Params_Data)");
class AppService_LaunchAppWithIntent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t app_type;
    int32_t event_flags;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;
    mojo::internal::Pointer<::apps::mojom::internal::Intent_Data> intent;
    int32_t launch_source;
    uint8_t pad4_[4];
    mojo::internal::Pointer<::apps::mojom::internal::WindowInfo_Data> window_info;

private:
    friend class mojo::internal::MessageFragment<AppService_LaunchAppWithIntent_Params_Data>;

    AppService_LaunchAppWithIntent_Params_Data();
    ~AppService_LaunchAppWithIntent_Params_Data() = delete;
};
static_assert(sizeof(AppService_LaunchAppWithIntent_Params_Data) == 48, "Bad sizeof(AppService_LaunchAppWithIntent_Params_Data)");
class AppService_LaunchAppWithIntent_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<AppService_LaunchAppWithIntent_ResponseParams_Data>;

    AppService_LaunchAppWithIntent_ResponseParams_Data();
    ~AppService_LaunchAppWithIntent_ResponseParams_Data() = delete;
};
static_assert(sizeof(AppService_LaunchAppWithIntent_ResponseParams_Data) == 16, "Bad sizeof(AppService_LaunchAppWithIntent_ResponseParams_Data)");
class AppService_SetPermission_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t app_type;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;
    mojo::internal::Pointer<::apps::mojom::internal::Permission_Data> permission;

private:
    friend class mojo::internal::MessageFragment<AppService_SetPermission_Params_Data>;

    AppService_SetPermission_Params_Data();
    ~AppService_SetPermission_Params_Data() = delete;
};
static_assert(sizeof(AppService_SetPermission_Params_Data) == 32, "Bad sizeof(AppService_SetPermission_Params_Data)");
class AppService_Uninstall_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t app_type;
    int32_t uninstall_source;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;
    uint8_t clear_site_data : 1;
    uint8_t report_abuse : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<AppService_Uninstall_Params_Data>;

    AppService_Uninstall_Params_Data();
    ~AppService_Uninstall_Params_Data() = delete;
};
static_assert(sizeof(AppService_Uninstall_Params_Data) == 32, "Bad sizeof(AppService_Uninstall_Params_Data)");
class AppService_PauseApp_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t app_type;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;

private:
    friend class mojo::internal::MessageFragment<AppService_PauseApp_Params_Data>;

    AppService_PauseApp_Params_Data();
    ~AppService_PauseApp_Params_Data() = delete;
};
static_assert(sizeof(AppService_PauseApp_Params_Data) == 24, "Bad sizeof(AppService_PauseApp_Params_Data)");
class AppService_UnpauseApp_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t app_type;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;

private:
    friend class mojo::internal::MessageFragment<AppService_UnpauseApp_Params_Data>;

    AppService_UnpauseApp_Params_Data();
    ~AppService_UnpauseApp_Params_Data() = delete;
};
static_assert(sizeof(AppService_UnpauseApp_Params_Data) == 24, "Bad sizeof(AppService_UnpauseApp_Params_Data)");
class AppService_StopApp_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t app_type;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;

private:
    friend class mojo::internal::MessageFragment<AppService_StopApp_Params_Data>;

    AppService_StopApp_Params_Data();
    ~AppService_StopApp_Params_Data() = delete;
};
static_assert(sizeof(AppService_StopApp_Params_Data) == 24, "Bad sizeof(AppService_StopApp_Params_Data)");
class AppService_GetMenuModel_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t app_type;
    int32_t menu_type;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;
    int64_t display_id;

private:
    friend class mojo::internal::MessageFragment<AppService_GetMenuModel_Params_Data>;

    AppService_GetMenuModel_Params_Data();
    ~AppService_GetMenuModel_Params_Data() = delete;
};
static_assert(sizeof(AppService_GetMenuModel_Params_Data) == 32, "Bad sizeof(AppService_GetMenuModel_Params_Data)");
class AppService_GetMenuModel_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::apps::mojom::internal::MenuItems_Data> menu_items;

private:
    friend class mojo::internal::MessageFragment<AppService_GetMenuModel_ResponseParams_Data>;

    AppService_GetMenuModel_ResponseParams_Data();
    ~AppService_GetMenuModel_ResponseParams_Data() = delete;
};
static_assert(sizeof(AppService_GetMenuModel_ResponseParams_Data) == 16, "Bad sizeof(AppService_GetMenuModel_ResponseParams_Data)");
class AppService_ExecuteContextMenuCommand_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t app_type;
    int32_t command_id;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;
    mojo::internal::Pointer<mojo::internal::String_Data> shortcut_id;
    int64_t display_id;

private:
    friend class mojo::internal::MessageFragment<AppService_ExecuteContextMenuCommand_Params_Data>;

    AppService_ExecuteContextMenuCommand_Params_Data();
    ~AppService_ExecuteContextMenuCommand_Params_Data() = delete;
};
static_assert(sizeof(AppService_ExecuteContextMenuCommand_Params_Data) == 40, "Bad sizeof(AppService_ExecuteContextMenuCommand_Params_Data)");
class AppService_OpenNativeSettings_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t app_type;
    uint8_t pad0_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;

private:
    friend class mojo::internal::MessageFragment<AppService_OpenNativeSettings_Params_Data>;

    AppService_OpenNativeSettings_Params_Data();
    ~AppService_OpenNativeSettings_Params_Data() = delete;
};
static_assert(sizeof(AppService_OpenNativeSettings_Params_Data) == 24, "Bad sizeof(AppService_OpenNativeSettings_Params_Data)");
class AppService_SetResizeLocked_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t app_type;
    int32_t locked;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;

private:
    friend class mojo::internal::MessageFragment<AppService_SetResizeLocked_Params_Data>;

    AppService_SetResizeLocked_Params_Data();
    ~AppService_SetResizeLocked_Params_Data() = delete;
};
static_assert(sizeof(AppService_SetResizeLocked_Params_Data) == 24, "Bad sizeof(AppService_SetResizeLocked_Params_Data)");
class AppService_SetWindowMode_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t app_type;
    int32_t window_mode;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;

private:
    friend class mojo::internal::MessageFragment<AppService_SetWindowMode_Params_Data>;

    AppService_SetWindowMode_Params_Data();
    ~AppService_SetWindowMode_Params_Data() = delete;
};
static_assert(sizeof(AppService_SetWindowMode_Params_Data) == 24, "Bad sizeof(AppService_SetWindowMode_Params_Data)");
class AppService_SetRunOnOsLoginMode_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    int32_t app_type;
    int32_t run_on_os_login_mode;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;

private:
    friend class mojo::internal::MessageFragment<AppService_SetRunOnOsLoginMode_Params_Data>;

    AppService_SetRunOnOsLoginMode_Params_Data();
    ~AppService_SetRunOnOsLoginMode_Params_Data() = delete;
};
static_assert(sizeof(AppService_SetRunOnOsLoginMode_Params_Data) == 24, "Bad sizeof(AppService_SetRunOnOsLoginMode_Params_Data)");
class Publisher_Connect_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Interface_Data subscriber;
    mojo::internal::Pointer<internal::ConnectOptions_Data> opts;

private:
    friend class mojo::internal::MessageFragment<Publisher_Connect_Params_Data>;

    Publisher_Connect_Params_Data();
    ~Publisher_Connect_Params_Data() = delete;
};
static_assert(sizeof(Publisher_Connect_Params_Data) == 24, "Bad sizeof(Publisher_Connect_Params_Data)");
class Publisher_Launch_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;
    int32_t event_flags;
    int32_t launch_source;
    mojo::internal::Pointer<::apps::mojom::internal::WindowInfo_Data> window_info;

private:
    friend class mojo::internal::MessageFragment<Publisher_Launch_Params_Data>;

    Publisher_Launch_Params_Data();
    ~Publisher_Launch_Params_Data() = delete;
};
static_assert(sizeof(Publisher_Launch_Params_Data) == 32, "Bad sizeof(Publisher_Launch_Params_Data)");
class Publisher_LaunchAppWithFiles_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;
    int32_t event_flags;
    int32_t launch_source;
    mojo::internal::Pointer<::apps::mojom::internal::FilePaths_Data> file_paths;

private:
    friend class mojo::internal::MessageFragment<Publisher_LaunchAppWithFiles_Params_Data>;

    Publisher_LaunchAppWithFiles_Params_Data();
    ~Publisher_LaunchAppWithFiles_Params_Data() = delete;
};
static_assert(sizeof(Publisher_LaunchAppWithFiles_Params_Data) == 32, "Bad sizeof(Publisher_LaunchAppWithFiles_Params_Data)");
class Publisher_LaunchAppWithIntent_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;
    int32_t event_flags;
    int32_t launch_source;
    mojo::internal::Pointer<::apps::mojom::internal::Intent_Data> intent;
    mojo::internal::Pointer<::apps::mojom::internal::WindowInfo_Data> window_info;

private:
    friend class mojo::internal::MessageFragment<Publisher_LaunchAppWithIntent_Params_Data>;

    Publisher_LaunchAppWithIntent_Params_Data();
    ~Publisher_LaunchAppWithIntent_Params_Data() = delete;
};
static_assert(sizeof(Publisher_LaunchAppWithIntent_Params_Data) == 40, "Bad sizeof(Publisher_LaunchAppWithIntent_Params_Data)");
class Publisher_LaunchAppWithIntent_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    uint8_t success : 1;
    uint8_t padfinal_[7];

private:
    friend class mojo::internal::MessageFragment<Publisher_LaunchAppWithIntent_ResponseParams_Data>;

    Publisher_LaunchAppWithIntent_ResponseParams_Data();
    ~Publisher_LaunchAppWithIntent_ResponseParams_Data() = delete;
};
static_assert(sizeof(Publisher_LaunchAppWithIntent_ResponseParams_Data) == 16, "Bad sizeof(Publisher_LaunchAppWithIntent_ResponseParams_Data)");
class Publisher_SetPermission_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;
    mojo::internal::Pointer<::apps::mojom::internal::Permission_Data> permission;

private:
    friend class mojo::internal::MessageFragment<Publisher_SetPermission_Params_Data>;

    Publisher_SetPermission_Params_Data();
    ~Publisher_SetPermission_Params_Data() = delete;
};
static_assert(sizeof(Publisher_SetPermission_Params_Data) == 24, "Bad sizeof(Publisher_SetPermission_Params_Data)");
class Publisher_Uninstall_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;
    int32_t uninstall_source;
    uint8_t clear_site_data : 1;
    uint8_t report_abuse : 1;
    uint8_t padfinal_[3];

private:
    friend class mojo::internal::MessageFragment<Publisher_Uninstall_Params_Data>;

    Publisher_Uninstall_Params_Data();
    ~Publisher_Uninstall_Params_Data() = delete;
};
static_assert(sizeof(Publisher_Uninstall_Params_Data) == 24, "Bad sizeof(Publisher_Uninstall_Params_Data)");
class Publisher_PauseApp_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;

private:
    friend class mojo::internal::MessageFragment<Publisher_PauseApp_Params_Data>;

    Publisher_PauseApp_Params_Data();
    ~Publisher_PauseApp_Params_Data() = delete;
};
static_assert(sizeof(Publisher_PauseApp_Params_Data) == 16, "Bad sizeof(Publisher_PauseApp_Params_Data)");
class Publisher_UnpauseApp_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;

private:
    friend class mojo::internal::MessageFragment<Publisher_UnpauseApp_Params_Data>;

    Publisher_UnpauseApp_Params_Data();
    ~Publisher_UnpauseApp_Params_Data() = delete;
};
static_assert(sizeof(Publisher_UnpauseApp_Params_Data) == 16, "Bad sizeof(Publisher_UnpauseApp_Params_Data)");
class Publisher_StopApp_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;

private:
    friend class mojo::internal::MessageFragment<Publisher_StopApp_Params_Data>;

    Publisher_StopApp_Params_Data();
    ~Publisher_StopApp_Params_Data() = delete;
};
static_assert(sizeof(Publisher_StopApp_Params_Data) == 16, "Bad sizeof(Publisher_StopApp_Params_Data)");
class Publisher_GetMenuModel_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;
    int32_t menu_type;
    uint8_t pad1_[4];
    int64_t display_id;

private:
    friend class mojo::internal::MessageFragment<Publisher_GetMenuModel_Params_Data>;

    Publisher_GetMenuModel_Params_Data();
    ~Publisher_GetMenuModel_Params_Data() = delete;
};
static_assert(sizeof(Publisher_GetMenuModel_Params_Data) == 32, "Bad sizeof(Publisher_GetMenuModel_Params_Data)");
class Publisher_GetMenuModel_ResponseParams_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<::apps::mojom::internal::MenuItems_Data> menu_items;

private:
    friend class mojo::internal::MessageFragment<Publisher_GetMenuModel_ResponseParams_Data>;

    Publisher_GetMenuModel_ResponseParams_Data();
    ~Publisher_GetMenuModel_ResponseParams_Data() = delete;
};
static_assert(sizeof(Publisher_GetMenuModel_ResponseParams_Data) == 16, "Bad sizeof(Publisher_GetMenuModel_ResponseParams_Data)");
class Publisher_ExecuteContextMenuCommand_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;
    int32_t command_id;
    uint8_t pad1_[4];
    mojo::internal::Pointer<mojo::internal::String_Data> shortcut_id;
    int64_t display_id;

private:
    friend class mojo::internal::MessageFragment<Publisher_ExecuteContextMenuCommand_Params_Data>;

    Publisher_ExecuteContextMenuCommand_Params_Data();
    ~Publisher_ExecuteContextMenuCommand_Params_Data() = delete;
};
static_assert(sizeof(Publisher_ExecuteContextMenuCommand_Params_Data) == 40, "Bad sizeof(Publisher_ExecuteContextMenuCommand_Params_Data)");
class Publisher_OpenNativeSettings_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;

private:
    friend class mojo::internal::MessageFragment<Publisher_OpenNativeSettings_Params_Data>;

    Publisher_OpenNativeSettings_Params_Data();
    ~Publisher_OpenNativeSettings_Params_Data() = delete;
};
static_assert(sizeof(Publisher_OpenNativeSettings_Params_Data) == 16, "Bad sizeof(Publisher_OpenNativeSettings_Params_Data)");
class Publisher_SetResizeLocked_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;
    int32_t locked;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Publisher_SetResizeLocked_Params_Data>;

    Publisher_SetResizeLocked_Params_Data();
    ~Publisher_SetResizeLocked_Params_Data() = delete;
};
static_assert(sizeof(Publisher_SetResizeLocked_Params_Data) == 24, "Bad sizeof(Publisher_SetResizeLocked_Params_Data)");
class Publisher_SetWindowMode_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;
    int32_t window_mode;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Publisher_SetWindowMode_Params_Data>;

    Publisher_SetWindowMode_Params_Data();
    ~Publisher_SetWindowMode_Params_Data() = delete;
};
static_assert(sizeof(Publisher_SetWindowMode_Params_Data) == 24, "Bad sizeof(Publisher_SetWindowMode_Params_Data)");
class Publisher_SetRunOnOsLoginMode_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::String_Data> app_id;
    int32_t run_on_os_login_mode;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Publisher_SetRunOnOsLoginMode_Params_Data>;

    Publisher_SetRunOnOsLoginMode_Params_Data();
    ~Publisher_SetRunOnOsLoginMode_Params_Data() = delete;
};
static_assert(sizeof(Publisher_SetRunOnOsLoginMode_Params_Data) == 24, "Bad sizeof(Publisher_SetRunOnOsLoginMode_Params_Data)");
class Subscriber_OnApps_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::apps::mojom::internal::App_Data>>> deltas;
    int32_t app_type;
    uint8_t should_notify_initialized : 1;
    uint8_t padfinal_[3];

private:
    friend class mojo::internal::MessageFragment<Subscriber_OnApps_Params_Data>;

    Subscriber_OnApps_Params_Data();
    ~Subscriber_OnApps_Params_Data() = delete;
};
static_assert(sizeof(Subscriber_OnApps_Params_Data) == 24, "Bad sizeof(Subscriber_OnApps_Params_Data)");
class Subscriber_OnCapabilityAccesses_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Pointer<mojo::internal::Array_Data<mojo::internal::Pointer<::apps::mojom::internal::CapabilityAccess_Data>>> deltas;

private:
    friend class mojo::internal::MessageFragment<Subscriber_OnCapabilityAccesses_Params_Data>;

    Subscriber_OnCapabilityAccesses_Params_Data();
    ~Subscriber_OnCapabilityAccesses_Params_Data() = delete;
};
static_assert(sizeof(Subscriber_OnCapabilityAccesses_Params_Data) == 16, "Bad sizeof(Subscriber_OnCapabilityAccesses_Params_Data)");
class Subscriber_Clone_Params_Data {
public:
    static bool Validate(const void* data, mojo::internal::ValidationContext* validation_context);

    mojo::internal::StructHeader header_;
    mojo::internal::Handle_Data receiver;
    uint8_t padfinal_[4];

private:
    friend class mojo::internal::MessageFragment<Subscriber_Clone_Params_Data>;

    Subscriber_Clone_Params_Data();
    ~Subscriber_Clone_Params_Data() = delete;
};
static_assert(sizeof(Subscriber_Clone_Params_Data) == 16, "Bad sizeof(Subscriber_Clone_Params_Data)");

} // namespace internal
class AppService_RegisterPublisher_ParamsDataView {
public:
    AppService_RegisterPublisher_ParamsDataView() = default;

    AppService_RegisterPublisher_ParamsDataView(internal::AppService_RegisterPublisher_Params_Data* data, mojo::Message* message)
        : data_(data)
        , message_(message)
    {
    }

    bool is_null() const { return !data_; }
    template <typename UserType> UserType TakePublisher()
    {
        UserType result;
        bool ret = mojo::internal::Deserialize<mojo::InterfacePtrDataView<::apps::mojom::PublisherInterfaceBase>>(&data_->publisher, &result, message_);
        DCHECK(ret);
        return result;
    }
    template <typename UserType> [[nodiscard]] bool ReadAppType(UserType* output) const
    {
        auto data_value = data_->app_type;
        return mojo::internal::Deserialize<::apps::mojom::AppType>(data_value, output);
